import HamburgerMenu from '../components/Menu';
import '../../styles/DiseaseInfo.css';
import Contacts from '../components/Contacts';

export default function ClinicalCourse(){
    return (
        <div>
            <HamburgerMenu />
            <div className='generalStyle'>
            <div className="blockWhite">
                <div className="textHeaderGrey">
                    <p>Как может развиваться заболевание (варианты прогрессирования)?</p>
                </div>
            </div>
            <div className="blockWhite">
                 <div className="textGrey">
                    <p>Течение ГКМП очень непредсказуемо и разное у всех. Условно можно выделить несколько сценариев:</p>
                    <p>Стабильное, бессимптомное течение: У многих людей ГКМП десятилетиями не прогрессирует и 
                        не вызывает серьезных проблем. Требуется лишь регулярное наблюдение.</p>
                    <p>Прогрессирование симптомов: Со временем могут усиливаться одышка, 
                        усталость, боли в груди. Это может потребовать изменения терапии.</p>
                    <p>Развитие сердечной недостаточности: Из-за постоянной жесткости мышцы сердце хуже наполняется кровью. 
                        Это называется диастолической сердечной недостаточностью. Симптомы: нарастающая одышка, отеки, снижение переносимости нагрузок.</p>
                    <p>Появление жизнеугрожающих нарушений ритма: Самое опасное осложнение — фибрилляция желудочков, приводящая к внезапной смерти. Риск 
                        повышен, но его можно оценить и принять соответствующие меры. Другая частая аритмия — фибрилляция предсердий, которая повышает риск инсульта.</p>
                    <p>«Переход» в стадию «выгорания»: У небольшого процента пациентов (чаще в пожилом возрасте) утолщенная мышца со временем может истончаться, терять 
                        силу и растягиваться, приводя к сердечной недостаточности (сердце плохо качает кровь). В этой стадии лечение схоже с терапией других видов сердечной недостаточности.</p>
                </div>
            </div>
                <div style={{'display' : 'flex', 'justify-content' : 'flex-end'}}>
                    <div style={{'font-size' : '14px', 'width' : 'fit-content'}} className='quoteStyle'>Дата последнего обновления статьи: 5.02.26</div>
                </div>
            </div>
            <Contacts />
        </div>

    )
}