import HamburgerMenu from '../components/Menu';
import TextSwitcher from '../components/TextSwitcher';
import '../../styles/DiseaseInfo.css';
import {dataExams, infotext} from '../../data/texts/diseaseinfo';

export default function Diagnosis(){
    return (
        <div className='generalStyle'>
            <HamburgerMenu />
            <div className="blockRed">
                <div className="textWhite">
                    <p>{infotext.Intro[0]}</p>
                    <p>{infotext.Intro[1]}</p>
                </div>
            </div>
            <div className="blockWhite">
                <div className="textHeaderGrey">
                    {infotext.HowDiagnosed[0]}
                </div>
                <div className='textGrey'>
                    <p>
                        Это не так просто, особенно если генетическое тестирование не дало результатов 
                        (что случается в более половины случаев). У ГКМП есть фенокопии - заболевания, которые выглядят так же, 
                        но причина у них другая. Некоторые из них тоже генетические, некоторые нет.
                    </p>
                    <p>Вот ориентировочный список состояний, которые можно спутать с ГКМП:</p>
                    <ol>
                        <li><b>Физиологическая гипертрофия</b> - например, у атлетов.</li>
                        <li><b>Гипертрофия из-за длительного повышенного давления</b> - гипертонической болезни.</li>
                        <li><b>Аортальный стеноз</b> - проблема с клапаном, приводящая к усилению работы сердца и к гипертрофии вследствие адаптации.</li>
                        <li><b>Амилоидоз сердца (AL или ATTR).</b> Болезнь, при которой накапливаются неправильные белки, которые заполоняют организм 
                        (поэтому проблемы будут не только с сердцем, но и с другими органами - почками, нервной системой, печенью). 
                            Из-за наличия дополнительной массы белко сердце выглядит гипертрофированным.</li>
                        <li><b>Болезнь Фабри.</b>Генетическая болезнь, которая приводит к проблемам с сердцем. 
                        Обычно сопровождается другими симптомами - ангиокератомами (красными выпуклыми пятнами), парестезиями (изменением ощущений, например 
                        жара или боли без соотвествующих стимулов) и проблемами с почками.</li>
                        <li>Другие генетические заболевания (болезнь Помпе, Форбса-Кори, синдром Данона, синдром Нунан, синдром LEOPARD). 
                            Все они имеют и другие характерные проявления, кроме проблем с сердцем.</li>
                    </ol>
                    <p>Для того, чтобы удостовериться в диагнозе и понять как Вас лечить, врачам необходимо будет сделать ряд обследований. 
                        Краткую информацию про них можно прочесть ниже:</p>
                </div>
            </div>

            <TextSwitcher data={dataExams}/>
        </div>

    )
}