import HamburgerMenu from '../components/Menu';
import '../../styles/DiseaseInfo.css';
import Contacts from '../components/Contacts';
import { Link } from 'react-router-dom';
import Revisor from '../components/Revisor';
import HCMgenes from '../../data/images/HCMgenes.jpg';

export default function Genetics(){
    return (
        <div>
            <HamburgerMenu />
            <div className='generalStyle'>
                <div className="blockWhite">
                    <div className="textHeaderGrey">
                        <p>Генетика ГКМП</p>
                    </div>
                    <div className='textGrey'>
                        <p>Давайте разберемся, как генные мутации могут вызывать ГКМП:</p>
                        <p><strong>Обычные инструкции: </strong>В нашем организме есть инструкции (гены), 
                        которые говорят нашим клеткам, как производить белки, которые являются строительными 
                        блоками для нашего тела.</p>
                        <p>
                            <strong>Мутации: </strong> Иногда в этих инструкциях могут быть ошибки или изменения (мутации). 
                            В случае ГКМП наблюдаются специфические генные мутации, связанные с белками в сердечной мышце.
                        </p>
                        <p>
                            <strong>Производство белка: </strong>Эти мутации нарушают синтез нормального белка, что приводить к 
                            нарушению процессов потребления энергии сердца и усиливает его сократимость, что в свою очередь 
                            приводит к гипертрофии миокарда.
                        </p>
                        <p>
                            <strong>Утолщение стенок сердца: </strong>
                            В результате стенки сердца становятся толще — это состояние известно как гипертрофия,  
                            что приводит к таким проблемам, как одышка или боль в груди.
                        </p>
                        <p>Проще говоря, генные мутации при ГКМП нарушают синтез белков, в результате чего сердечная 
                            мышца становится толще, и сердцу становится сложнее выполнять свою работу должным образом.</p>
                    <div className='blockWithImage'>
                        <img src={HCMgenes}></img>
                        <div>
                            <p><strong>Вовлеченные гены: </strong> Самыми распространенными саркомерными  генами являются ген, 
                        кодирующий тяжелые цепи бета-миозина MYH7 и ген, кодирующий миозин-связывающий белок C (MYBPC3), 
                        вместе они ответственны примерно за половину пациентов с семейной ГКМП. Мутации в генах TNNT2, 
                        TNNI3 и TPM1 являются относительно редкими причинами ГКМП и вместе отвечают менее чем за 10 % случаев. 
                        Мутации в ACTC1 (сердечный α-актин), MYL2 (легкая цепь миозина 2), MYL3 (легкая цепь миозина 3) и CSRP3 
                        (богатый цистеином и глицином белок 3) также являются установленными, хотя и редкими, причинами ГКМП. 
                        Доказательства причинной роли девяти вышеперечисленных генов в развитии ГКМП являются наиболее убедительными.</p>
                        <p>Мутации в FHOD3, ALPK3, MYOZ2 (миозенин 2), TRIM63 (убиквитин E3 лигаза трипартит мотив протеин 63 или MuRF1) и 
                            FHL1 (четыре с половиной LIM домена 1) также были связаны с причинами ГКМП, но обычно встречаются реже.</p>
                        </div>
                    </div>
                        <p>
                            Примерно у 60 % пациентов с ГКМП имеется четко распознаваемое семейное заболевание.
                        </p>
                        <p>
                            <strong>Является ли ГКМП заболеванием, характерным для определенных групп населения? </strong>
                            Нет. ГКМП — это заболевание, не имеющее четкой географической, этнической или половой структуры 
                            распространения. Распространенность ГКМП оценивается в 0,16% — 0,29% (~ 1:625 — 1:344 человек) 
                            в общей популяции взрослых.
                        </p>
                        <p>
                            <strong>Как наследуется ГКМП? </strong>
                            <p>Если у кого-то из родителей есть генная мутация, вызывающая ГКМП, они могут передать этот мутировавший ген своим детям. 
                            Вероятность того, что каждый ребенок унаследует мутацию составляет 50 на 50. Это похоже на подбрасывание монетки — 
                            она может упасть орлом (с мутацией) или решкой(без мутации).</p>
                        </p>
                        <p>Определение мутаций используется в диагностике ГКМП, однако как вспомогательное исследование. Про остальные можно прочитать в соответствующем разделе:</p>
                        <button className="navButton">
                            <Link to={'/disease-info/diagnosis'} className='navButtonLink'> Диагностика → </Link>
                        </button>
                        <p></p>
                        <p>Текст взят <a href='https://hcmpatient.eu/ru/'>с европейского сайта поддержки пациентов с ГКМП</a> с разрешения обладателей сайта. Сайт загружается с ВПН.</p>
                    </div>
                </div>
            </div>
            <Contacts />
        </div>)}