import HamburgerMenu from '../components/Menu';
import Contacts from '../components/Contacts';
import { Link } from 'react-router-dom';
import '../../styles/DiseaseInfo.css';
import hcmpvariants from '../../data/images/versions_illustration.png';
import normal from '../../data/images/normalheart.png';
import hcmp_heart from '../../data/images/heartwithhcmp.png';
import EchoDoppler from '../../data/images/EchoDoppler.gif';
import CTmotion from '../../data/images/CTmotion.gif';
import Ventriculogramma from '../../data/images/ventriculogramm.gif';
import heartsection from '../../data/images/heartsection.png';

export default function WhatIsHCMP(){
    return (
        <div>
            <HamburgerMenu />   
            <div className='generalStyle'>
                <div className="blockWhite">
                    <div className="textHeaderGrey">
                        Что происходит с сердцем при ГКМП?
                    </div>
                    <div className='textGrey'>
                        <div className="quoteStyle">
                        <h3 style={{'color' : '#5a5f91'}}><b>Этот текст поможет понять, как именно развивается болезнь. Он может показаться сложным,
                            однако если Вы решите разобраться в нем, то понять свое сердце, Вашего врача и его назначения будет проще.</b></h3>
                        </div>
                    <div className='blockWithImage'>
                        <div>
                            <h2>Анатомия сердца</h2>
                            <p>
                                Сердце - это мышечный насос, который обуспечивает движение крови. У него есть 2 предсердия и 2 желудочка (по правой и левой камере). 
                                Вся венозная кровь поступает в правое предсердие, откуда через трикуспидальный клапан в правый желудочек. 
                                Затем через клапан лёгочной артерии и лёгочную артерию в легкие, где кровь насыщается кислородом. 
                                Из легких кровь собирается в легочные вены, которые впадают в левое предсердие. 
                                Левое предсердие через митральный клапан сообщается с левым желудочком. И оттуда через аортальный клапан кровь поступает в аорту и дальше во все артерии организма.
                                У сердца есть периоды сокращения и расслабления. И тот и другой невероятно важны. От того, как сердце сократится, 
                                зависит давление в артериях, а значит и поступление крови к другим органам. От того, как расслабится — его 
                                наполнение и питание (когда сердце сокращается, маленькие артерии пережимаются мышечными волокнами и кровь в них не может поступать).
                            </p>
                            <p>
                                У сердца есть периоды сокращения и расслабления. И тот и другой невероятно важны. От того, как сердце сократится, зависит давление в артериях,
                                а значит и поступление крови к другим органам. От того, как расслабится — его наполнение и питание (когда сердце сокращается, маленькие 
                                артерии пережимаются мышечными волокнами и кровь в них не может поступать). Сначала сокращаются предсердия, дополнительно нагнетая кровь 
                                в желудочки, а потом уже, когда клапаны между предсердиями и желудочками закрываются, желудочки.
                            </p>
                            <p>
                                Для работы сердца очень важен ритм — чтобы сокращения и расслабления регулярно чередовались. Поэтому в сердце есть свой электрогенератор 
                                — синусовый узел,. Он расположен в правом предсердии и по проводам из клеток распространяет возбуждение на всю ткань сердца. 
                                У сердца есть второй узел — атриовентрикулярный (переводится как предсердно-желудочковый). Через него проходит провод от 
                                предсердий к желудочкам. Он нужен, чтобы предсердия и желудочки не сокращались одновременно. Иначе предсердия будут сокращаться 
                                при закрытых клапанах — и растягиваться, как если бы через резиновую трубку закрыли с одного конца и стали подавать воду с другой. 
                                К тому же этот узел берет на себя роль генератора импульсов, если с синусовым узлом идет что-то не так. 

                            </p>
                            <p>
                                Дальше провода (в этот момент он носит название “пучок Гиса”) по межжелудочковой перегородке идут к желудочкам и 
                                разделяются на 2 ствола— правую и левую ножки пучка Гиса, а левая ножка еще на 2 ветви — переднюю и заднюю.
                            </p>
                        </div>
                        <div>
                             <img src={heartsection}></img>
                             <p>Сердце с ГКМП. Подписями отмечены камеры сердца.</p>
                        </div>
                    </div>
                <div className="blockWithImage">
                    <div>
                        <h2>Что происходит при гипертрофии</h2>
                    <p>Человеческое сердце, как и любая мышца, может тренироваться. Это и происходит, если организму нужны большие возможности 
                        для перекачивания крови — например, у профессиональных спортсменов. И, как и остальные мышцы, сердце тренируется, увеличиваясь 
                        в объеме. Этот процесс называется гипертрофией, 
                        и при нем количество саркомеров — моторов сердца — многократно возрастает, обеспечивая нужную мощность насоса.</p>
                        <p>
                        Но это в норме. <b>Гипертрофическая кардиомиопатия - это болезнь, при которой миокард сердца начинает утолщаться без 
                        видимых на то причин. Нет стимулов, ни физиологических, ни патологических.</b> Нет длительного повышения давления, нет 
                        повышенных физических нагрузок, нет препятствий для 
                        сердца, которые оно должно преодолевать, чтобы поддерживать движение крови по организму. 
                        Вдобавок к этому утолщение происходит неравномерно - чаще всего утолщается межжелудочковая перегородка.  
                        На рисунке изображены варианты гипертрофической кардиомиопатии (изображен левый желудочек - 2 отверстия наверху это аортальный и митральный клапан):
                        </p>
                    </div>
                    <img src={hcmpvariants}></img>
                </div>
                <div className="blockWithImage">
                    <div>
                    <img src={normal}></img>
                    <p><b>Сердце в норме (перевернутое, потому что именно так оно выглядит при ЭхоКГ).</b></p>
                    <img src={hcmp_heart}></img>
                    <p><b>Сердце при ГКМП (кровь движется в аорту, но утолщенная перегородка и створка митрального клапана перегораживают путь).</b></p>
                    </div>
                <div>
                    <p>
                        Да и сами кардиомиоциты расположены не упорядоченно, как это происходит при нормальной гипертрофии, а хаотично.  
                        Отсутствие структуры мешает двум важным процессам - кровоснабжению и распространению электрического импульса. 
                    </p>
                    <p>
                        В свою очередь перебои с кровоснабжением вызывают гибель кардиомиоцитов, замещающихся соединительной тканью. 
                        Это называется фиброз. Соединительная ткань обладает другими физическими характеристиками, нежели миокард — она 
                        не умеет сокращаться, является более жесткой и не проводит электрический ток. То есть ткань сердца в целом становится 
                        менее растяжимой и импульс по ней проводится хаотично.Из-за жесткости сердца замедлено его расслабление и наполнение 
                        кровью из предсердий — а значит, когда миокард сократится, выбросить много он не сможет.
                    </p>
                    <p>
                        Изменение в проведении электрического импульса ведет к грозным аритмиям — в сердце случаются короткие замыкания, ток 
                        блуждает по кругу, возбуждая миокард совсем не в том порядке, в котором надо. Так возникают экстрасистолы (добавочные 
                        желудочковые сокращения), а потом и желудочковые тахикардии и фибрилляция желудочков (желудочки перехватывают инициативу 
                        у синусового узла, как при добавочных желудочковых сокращениях, но делают это постоянно).
                    </p>
                    <p>
                        При варианте ГКМП с утолщенной перегородкой есть ещё одна проблема - она может частично перекрывать выход крови из левого 
                        желудочка в аорту (обструктивная форма). Это еще уменьшает количество крови, выбрасываемое левым желудочком, как при 
                        закрытии шланга одним пальцем. И увеличивает нагрузку на него — организм в попытке увеличить количество выбрасываемой крови 
                        стимулирует сердце сокращаться быстрее и сильнее (с помощью адреналина и норадреналина). В гипертрофированном сердце может 
                        поместиться не так много крови, а при увеличении ЧСС ещё и недостаточно времени для заполнения. Бывает и необструктивная форма, 
                        когда препятствия нет, но утолщение есть. Например, при апикальной гипертрофии — эта форма считается доброкачественной, при ней меньше осложнений и проявлений.
                    </p>
                    <p>
                        Также распространённым следствием является митральная недостаточность — митральный клапан (между левым предсердием и левым желудочком) 
                        от открывания удерживают папиллярные мышцы. При ГКМП они могут деформироваться и переставать выполнять свою функцию. 
                         Ещё одной причиной является притягивание створок митрального клапана к гипертрофированной межжелудочковой перегородке.
                        Это называется систолическим движением створки митрального клапана. Происходит это из-за увеличения скорости крови, 
                        выходящей в аорту. Если посмотреть на рисунок слева (сверху, если вы смотрите с мобильного телефона), то видно, как
                         близко на самом деле межжелудочковая перегородка и створки митрального клапана. Механизм этого явления называется 
                         феноменом Бернулли — два листочка бумаги приклеиваются друг ко другу, если между ними подуть с достаточной скоростью. 
                         Движение створки также перекрывает выход для крови, внося вклад в обструкцию. Иногда ненормальное положение папиллярных 
                         мышц и такие проблемы с митральным клапаном приводят к обструкции без гипертрофии перегородки. Ниже есть записи с исследований, 
                        которые показывают сердце с гипертрофической кардиомиопатией. Посмотрите их, они помогут Вам представить, как это выглядит!
                    </p>
                </div>
                </div>
                <div className='blockWithImage'>
                    <div>
                        <p>
                            <b>Это запись с ЭхоКГ - срез паралелльно грудине. Движущиеся цветные потоки - кровь, 
                                красная направлена к Вам, а синяя - от Вас. Более белые части - стенки сердца, 
                                более темные - полости камер. Стенки утолщены, а полость желудочка маленькая.</b>
                        </p>
                    </div>
                    <img src={EchoDoppler}></img>
                </div>
                <div className='blockWithImage'>
                    <div>
                        <p>
                            <b>На этой гифке изображено 3D КТ. Красным отмечены полости камер. </b>
                        </p>
                    </div>
                    <img src={CTmotion}></img>
                </div>
                <div className='blockWithImage'>
                    <div>
                        <p>
                            <b>Эта запись получена при исследовании, которое называется вентрикулография. В полость желудочков вводят 
                                рентген-контрастное вещество и делают рентгеновские снимки. </b>
                        </p>
                    </div>
                    <img src={Ventriculogramma}></img>
                </div>
                <div className='textGrey'>
                    <p>
                        Поздравляем Вас, Вы дочитали эту статью! Надеемся, что Вам будет понятнее, почему возникают те симптомы, которые, возможно, беспокоят Вас:
                    </p>
                    <button className="navButton">
                            <Link to={'/disease-info/symptoms'} className='navButtonLink'> Почитать про симптомы → </Link>
                    </button>
                </div>
                </div>
                </div>
                <div style={{'display' : 'flex', 'justify-content' : 'flex-end'}}>
                    <div style={{'font-size' : '14px', 'width' : 'fit-content'}} className='quoteStyle'>Дата последнего обновления статьи: 5.02.26</div>
                </div>
            </div>
            <Contacts />
        </div>

    )
}