import HamburgerMenu from '../components/Menu';
import Contacts from '../components/Contacts';
import '../../styles/DiseaseInfo.css';
import {infotext} from '../../data/texts/diseaseinfo';
import hcmpvariants from '../../data/images/versions_illustration.png';
import normal from '../../data/images/normalheart.png';
import hcmp_heart from '../../data/images/hcmp_heart.png';

export default function WhatIsHCMP(){
    return (
        <div>
            <HamburgerMenu />   
            <div className='generalStyle'>
                <div className="blockWhite">
                    <div className="textHeaderGrey">
                        Что происходит с сердцем при ГКМП?
                    </div>
                    <div className='textGrey'>
                        <p style={{'font-size' : '20px', 'width' : '50%'}}><b>Этот текст поможет понять, как именно развивается болезнь. Он может показаться сложным,
                            однако если Вы решите разобраться в нем, то понять свое сердце, Вашего врача и его назначения будет проще.</b></p>
                <div className="blockWithImage">
                    <div>
                    <p>Человеческое сердце, как и любая мышца, может тренироваться. Это и происходит, если организму нужны большие возможности 
                        для перекачивания крови — например, у профессиональных спортсменов. И, как и остальные мышцы, сердце тренируется, увеличиваясь 
                        в объеме. Этот процесс называется гипертрофией, 
                        и при нем количество саркомеров — моторов сердца — многократно возрастает, обеспечивая нужную мощность насоса.</p>
                        <p>
                        Но это в норме. <b>Гипертрофическая кардиомиопатия - это болезнь, при которой миокард сердца начинает утолщаться без 
                        видимых на то причин. Нет стимулов, ни физиологических, ни патологических.</b> Нет длительного повышения давления, нет 
                        повышенных физических нагрузок, нет препятствий для 
                        сердца, которые оно должно преодолевать, чтобы поддерживать движение крови по организму. 
                        Вдобавок к этому утолщение происходит неравномерно - чаще всего утолщается межжелудочковая перегородка.  
                        На рисунке изображены варианты гипертрофической кардиомиопатии (изображен левый желудочек - 2 отверстия наверху это аортальный и митральный клапан):
                        </p>
                    </div>
                    <img src={hcmpvariants}></img>
                </div>
                <div className="blockWithImage">
                    <div>
                    <img src={normal}></img>
                    <p><b>Сердце в норме (перевернутое, потому что именно так оно выглядит при ЭхоКГ).</b></p>
                    <img src={hcmp_heart}></img>
                    <p><b>Сердце при ГКМП (кровь движется в аорту, но утолщенная перегородки и створка митрального клапана перегораживают путь).</b></p>
                    </div>
                <div>
                    <p>
                        Да и сами кардиомиоциты расположены неупорядоченно, как это происходит при нормальной гипертрофии, а хаотично.  
                        Отсутствие структуры мешает двум важным процессам - кровоснабжению и распространению электрического импульса. 
                    </p>
                    <p>
                        В свою очередь перебои с кровоснабжением вызывают гибель кардиомиоцитов, замещающихся соединительной тканью. 
                        Это называется фиброз. Соединительная ткань обладает другими физическими характеристиками, нежели миокард — она 
                        не умеет сокращаться, является более жесткой и не проводит электрический ток. То есть ткань сердца в целом становится 
                        менее растяжимой и импульс по ней проводится хаотично.Из-за жесткости сердца замедлено его расслабление и наполнение 
                        кровью из предсердий — а значит, когда миокард сократится, выбросить много он не сможет.
                    </p>
                    <p>
                        Изменение в проведении электрического импульса ведет к грозным аритмиям — в сердце случаются короткие замыкания, ток 
                        блуждает по кругу, возбуждая миокард совсем не в том порядке, в котором надо. Так возникают экстрасистолы (добавочные 
                        желудочковые сокращения), а потом и желудочковые тахикардии и фибрилляция желудочков (желудочки перехватывают инициативу 
                        у синусового узла, как при добавочных желудочковых сокращениях, но делают это постоянно).
                    </p>
                    <p>
                        При варианте ГКМП с утолщенной перегородкой есть ещё одна проблема - она может частично перекрывать выход крови из левого 
                        желудочка в аорту (обструктивная форма). Это еще уменьшает количество крови, выбрасываемое левым желудочком, как при 
                        закрытии шланга одним пальцем. И увеличивает нагрузку на него — организм в попытке увеличить количество выбрасываемой крови 
                        стимулирует сердце сокращаться быстрее и сильнее (с помощью адреналина и норадреналина). В гипертрофированном сердце может 
                        поместиться не так много крови, а при увеличении ЧСС ещё и недостаточно времени для заполнения. Бывает и необструктивная форма, 
                        когда препятствия нет, но утолщение есть. Например, при апикальной гипертрофии — эта форма считается доброкачественной, при ней меньше осложнений и проявлений.
                    </p>
                    <p>
                        Также распространённым следствием является митральная недостаточность — митральный клапан (между левым предсердием и левым желудочком) 
                        от открывания удерживают папиллярные мышцы. При ГКМП они могут деформироваться и переставать выполнять свою функцию. Однако главной 
                        причиной является притягивание створок митрального клапана к гипертрофированной межжелудочковой перегородке. Механизм этого являения называется 
                        феноменом Бернулли — два листочка бумаги приклеиваются друг ко другу, если между ними подуть с достаточной скоростью. 
                    </p>
                </div>
                </div>
                </div>
                </div>
            </div>
            <Contacts />
        </div>

    )
}