import HamburgerMenu from '../components/Menu';
import TextSwitcher from '../components/TextSwitcher';
import '../../styles/DiseaseInfo.css';
import {devices} from '../../data/texts/treatment';

export default function Devices(){
    return (
        <div className='generalStyle'>
            <HamburgerMenu />

            <div className="blockWhite">
                <div className="textHeaderGrey">
                    Имплантируемые устройства
                </div>
                <p>Аритмии можно лечить не только с помощью препаратов, но и с помощью медицинских устройств — ИКД и ЭКС. 
                    ИКД используется для предотвращения внезапной сердечно-сосудистой смерти, ЭКС — когда предсердия 
                    не генерируют импульсы или они не проводятся к желудочкам.</p>
                <p></p>
                <p><b>Показания к установке ИКД:</b></p>
                <ol>
                    <li>HCM Risk-SCD {'>'} 6 % — рекомендован.</li>
                    <li>От 4% до 6% — решение принимается индивидуально, но рекомендуется установить ИКД если площадь 
                        фиброза {'≥'} 15% от массы ЛЖ (определяется при МРТ с контрастированием), или ФВ ЛЖ {'<'} 50 %, или 
                        есть аневризма верхушки ЛЖ (определяются при ЭхоКГ, при МРТ тоже).</li>
                    <li>Если {'<'} 4% и присутствуют перечисленные 3 критерия, решение принимается индивидуально.</li>
                    <li>После миоэктомии эта шкала неприменима, так как используемые критерии скорректированы операцией.
                        Тогда риски оценивают по другим шкалам.После этанольной септальной абляцией она все ещё может использоваться.</li>
                </ol>
                <p>Риск стоит переоценивать каждые 1-2 года, или если что-то поменялось 
                    (ухудшились симптомы, была проведена какая-либо операция, возникло другое заболевание).</p>
                <TextSwitcher data={devices} />
            </div>
        </div>

    )
}