import HamburgerMenu from '../components/Menu';
import '../../styles/DiseaseInfo.css';

export default function Life(){
    return (
        <div className='generalStyle'>
            <HamburgerMenu />

            <div className="textGrey">
                <div className="textHeaderGrey">
                    Как ГКМП может повлиять на жизнь
                </div>
                <div className='textSubheaderGrey'>Диета</div>
                <ul>
                    <li>Прием большого объема пищи может вызвать боли в грудной клетке, 
                        особенно у пациентов с обструкцией ВТЛЖ, поэтому рекомендуют частое дробное питание.</li>
                    <li>Запоры — частый побочный эффект верапамила, должны контролироваться диетой 
                        (повышение содержания клетчатки) и/или слабительными средствами.</li>
                    <li>Поддержание нормального веса — так как лишний вес является фактором риска сердечно-сосудистых заболеваний.</li>
                </ul>
                <div className='textSubheaderGrey'>Физические нагрузки</div>
                <ul>
                    <li>Относится только к высокоинтенсивным физическим нагрузкам и соревнованиям. 
                        Нагрузки умеренной и легкой интенсивности рекомендуются!</li>
                    <li>Если носительство гена никак не проявляется, то могут быть рассмотрены даже высокоинтенсивные 
                        нагрузки и участие в соревнованих  — решение принимает команда врачей.</li>
                </ul>
                
                <div className='textSubheaderGrey'>Профессия</div>
                <ul>
                    <li>Большинство пациентов с ГКМП могут продолжать обычную трудовую деятельность. 
                        Уровень физических усилий на работе должен соответствовать клиническому статусу пациента.</li>
                    <li>Для некоторых видов деятельности (пилотирование, военная служба) существуют строгие ограничения при приеме на работу.</li>
                </ul>
                <div className='textSubheaderGrey'>Вождение автомобиля</div>
                <ul>
                    <li>Можно получать водительские права и продолжать водить машину, если нет 
                        инвалидизирующих симптомов (ограничивающих повседневную активность).</li>
                </ul>
                <div className='textSubheaderGrey'>Вакцинация</div>
                <ul>
                    <li>При отсутствии противопоказаний рекомендована ежегодная вакцинация от гриппа. 
                        Грипп вызывает много сердечно-сосудистых осложнений, поэтому стоит поберечь сердце.</li>
                </ul>
                <div className='textSubheaderGrey'>Авиаперелеты</div>
                <ul>
                    <li>Большинство бессимптомных пациентов или с незначительной симптоматикой могут безопасно совершать авиаперелеты.</li>
                </ul>
            </div>
        </div>

    )
}