import HamburgerMenu from '../components/Menu';
import '../../styles/DiseaseInfo.css';
import Contacts from '../components/Contacts';
import { Link } from 'react-router-dom';

export default function Treatment(){
    return (
        <div>
            <HamburgerMenu />
            <div className='generalStyle'>
                <div className="blockWhite">
                    <div className="textHeaderGrey">
                        Принципы лечения
                    </div>
                    <div className="textGrey">
                        <p>
                            К сожалению, пока специфической терапии, которая бы вылечила генную поломку, не существует. 
                            Однако есть препараты, которые действуют на механизмы развития этой болезни и облегчают симптомы. 
                            Наиболее специфичным являются препараты из новой группы ингибиторов миозина — афикамтен и мевакамтен. 
                            Подробнее про них можно прочитать в слайдере ниже.
                        </p>
                        <p>
                            Есть и другие лекарства, которые уменьшают выраженность симптомов — бета-блокаторы и блокаторы 
                            кальциевых каналов (как они действуют, также можно прочесть ниже). 
                        </p>
                        <p>
                            Кардинальным решением является операция — септальная миоэктомия. Есть и менее инвазивный вариант 
                            этого вмешательства — этанольная септальная абляция. Есть и вариант, если ничего не помогает — трансплантация сердца.
                        </p>
                        <p>
                            Однако ГКМП неприятна не только своими симптомами, при этом заболевании есть риск внезапной смерти из-за аритмий. 
                            Чтобы его снизить, используются имплантируемые устройства — чаще всего это ИКД, имплантируемый кардиовертер-дефибриллятор. 
                        </p>
                        <p>
                            На этом основные методы лечения именно гипертрофической кардиомиопатии заканчиваются. Остальные лекарства, которые могут 
                            Вам прописать или вмешательства, которые могут назначить, скорее всего будут иметь своей целью не само заболевание, 
                            а его осложнения — фибрилляцию предсердий, недостаточность митрального клапана, сердечную недостаточность. 
                            Либо другие заболевания, наличие которых ГКМП не исключает. Есть моменты, которые отличаются, однако в 
                            общем схемы лечения такие же, как и если бы у этих заболеваний причина была другая. Очень большое количество людей 
                            болеет фибрилляцией предсердий и другими состояниями, поэтому эти алгоритмы отработаны и хорошо изучены.
                        </p>
                    </div>
                </div>
                <div style={{'display' : 'flex', 'justify-content' : 'flex-end'}}>
                    <div style={{'font-size' : '14px', 'width' : 'fit-content'}} className='quoteStyle'>Дата последнего обновления статьи: 13.02.26</div>
                </div>
            </div>
            <Contacts />
        </div>

    )
}