import HamburgerMenu from './components/Menu';
import '../styles/DiseaseInfo.css';
import Contacts from './components/Contacts';
import {infotext} from '../data/texts/diseaseinfo';
import help from '../data/images/help.jpg';

export default function DiseaseInfo(){
    return (
        <div>
            <HamburgerMenu />
            <div className='generalStyle'>
            <div className="blockWhite">
                <div className='blockWithImage' style={{'background-color' : '#f0f0f3', 'border-radius' : '25px'}}>
                    <div className="textGrey">
                        <p><b>Гипертрофическая кардиомиопатия (ГКМП) — наиболее распространенное наследственное заболевание сердца. 
                            Если вам поставили этот диагноз, важно понимать: вы не одиноки, 
                            а современная кардиология обладает четкими алгоритмами эффективного управления этим состоянием.</b></p>
                    </div>
                    <img src={help} style={{'width' : '30%', 'margin' : '0px 25px'}}></img>
                </div>
                <div className="textHeaderGrey">
                   Что же такое ГКМП?
                </div>
                <div className="textGrey">
                    <p>Самое важное:
                    </p>  
                    <ul>
                    <li>Распространенность: ГКМП встречается у 1 из 200 человек в общей популяции. 
                        В России с этим заболеванием живут 300 тысяч (с установленным диагнозом).</li>
                    <li>Суть диагноза: Это генетически обусловленное утолщение (гипертрофия) стенки левого желудочка сердца.
                         Чаще всего это не связано с артериальной гипертензией или пороками клапанов.</li>
                    <li>Вариативность течения: Крайне важно, что течение болезни индивидуально. У значительной части пациентов (до 70%) 
                        ГКМП протекает малосимптомно или бессимптомно на протяжении всей жизни, не приводя к серьезным осложнениям.</li>
                    </ul>
                </div>
                <div className="textSubheaderGrey">
                    Почему не стоит паниковать?
                </div>
                <div className="textGrey">
                    <ul> 
                        <li>ГКМП — одно из самых изученных заболеваний сердца. О нем известно очень много, и врачи во всем мире имеют четкие, 
                            эффективные протоколы наблюдения и лечения. Вы не останетесь один на один с диагнозом.</li>
                        <li>Риск внезапной сердечной смерти при ГКМП: 0,2% в год. В то же время риск смерти от автокатастрофы: 0.3% в год</li>
                        <li>Общая смертность от ГКМП составляет около 1% в год, </li>
                        <li>Медицина предлагает целый арсенал помощи. Если симптомы (например, одышка, сердцебиение) все же появляются, 
                             есть много вариантов: от хорошо переносимых современных лекарств до малоинвазивных процедур (например, 
                            септальная алкогольная абляция) и хирургических операций (миэктомия), которые радикально решают проблему. 
                            А для контроля рисков существуют современные устройства, такие как кардиовертеры-дефибрилляторы (ИКД).</li>
                    </ul>
                </div>
                <div className="textSubheaderGrey">
                    Что делать прямо сейчас?
                </div>
                <div className="textGrey">
                    <ol>
                        <li><b>Найдите своего врача.</b> Ищите кардиолога, который специализируется на ГКМП или наследственных заболеваниях сердца. 
                            Вы имеете право на второе мнение.</li>
                        <li><b>Задавайте вопросы.</b> Составьте список всего, что вас волнует, перед приемом. «Что означает моя конкретная ситуация?»,
                             «Какая физическая активность мне полезна?», «Как часто нужно приходить на осмотр?».</li>
                        <li><b>Обращайтесь в сообщества.</b> Существуют пациентские организации и проверенные онлайн-ресурсы, 
                            где можно пообщаться с теми, кто уже много лет живет с ГКМП. Ссылки на найденные выложены на главной странице.</li>
                        <li><b>Прочитайте информацию на этом сайте.</b>Тут собраны краткие выжимки проверенной полезной информации, 
                        которая может помочь Вам понять своё заболевание и как с ним жить</li>
                    </ol>
                </div>
                <div className="textGrey">
                    <p>ГКМП — это диагноз, а не приговор. Это особенность вашего сердца, которая требует внимания, 
                        но не должна отбирать радость жизни. ГКМП — хроническое состояние, которое сегодня может быть контролируемым. 
                        Эффективность лечения основана на доказательной медицине и точной стратификации рисков. 
                        Главная задача — перевести диагноз в стадию устойчивой компенсации и продолжать жить активной жизнью.
                    </p>
                </div>
            </div>
            </div>
            <Contacts />
        </div>
    );
}