export const centers = [
    {
        id: 1,
        name: <p>НМИЦ сердечно-сосудистой хирургии им. А. Н. Бакулева, кардиохирургическое отделение № 15</p>,
        city: 'Москва',
        img: ''
    },
    {
        id: 2,
        name: <p>II кардиохирургическое отделение (отделение хирургического лечения дисфункций миокарда и 
            сердечной недостаточности) в Российском научном центре хирургии им. Б.В. Петровского</p>,
        city: 'Москва'
    },
    {
        id: 3,
        name: <p>Отдел заболеваний миокарда и сердечной недостаточности (9‑е клиническое отделение) в 
            НМИЦ кардиологии им. Е.И. Чазова</p>,
        city: 'Москва'
    },
    {
        id: 4,
        name: <p>Кардиохирургическое отделение ФНКЦ ФМБА России</p>,
        city: 'Москва'
    }
]