import hcmpvariants from '../../data/images/hcmpvariants.jpg';
import ECG1 from '../../data/images/ECG1.jpg';
import Echo1 from "../../data/images/Echo1.png";
import MRI1 from "../../data/images/MRI1.png";
import stetoscope from "../../data/images/stetoscope.jpg";
import holter from "../../data/images/holter.jpg";
import analysis from "../../data/images/analysis.jpg";


export const infotext = {Intro: ["", "Здравствуйте! Этот текст поможет вам понять, что такое гипертрофическая кардиомиопатия, как её распознать и что делать дальше. Помните, что эта информация носит ознакомительный характер и не заменяет консультацию с вашим лечащим врачом-кардиологом."],
    WhatIs: ["Что это такое?", "Человеческое сердце, как и любая мышца, может тренироваться. Это и происходит, если организму нужны большие возможности для перекачивания крови — например, у профессинальных спортсменов. И, как и остальные мышцы, сердце тренируется, увеличиваясь в объеме. Этот процесс называется гипертрофией, и при нем количество саркомеров — моторов сердца — многократно возрастает, обеспечивая нужную мощность насоса.",  
"Но это в норме. Гипертрофическая кардиомиопатия - это болезнь, при которой миокард сердца начинает утолщаться без видимых на то причин. Нет стимулов, ни физиологических, ни патологических. Нет длительного повышения давления, нет повышенных физических нагрузок, нет препятствий для сердца, которые оно должно преодолевать, чтобы поддерживать движение крови по организму. Вдобавок к этому утолщение происходит неравномерно - чаще всего утолщается межжелудочковая перегородка.  На схеме избражены варианты гипертрофической кардиомиопатии:",
"Да и сами кардиомиоциты расположены неупорядоченно, как это происходит при нормальной гипертрофии, а хаотично.  Отсутствие структуры мешает двум важным процессам - кровоснабжению и распространению электрического импульса.","В свою очередь перебои с кровоснабжением вызывают гибель кардиомиоцитов, замещающихся соединительной тканью. Это называется фиброз. Соединительная ткань обладает другими физическими характеристиками, нежели миокард — она не умеет сокращаться, является более жесткой и не проводит электрический ток. То есть ткань сердца в целом становится менее растяжимой и импульс по ней проводится хаотично.",
"Из-за жесткости сердца замедлено его расслабление и наполнение кровью из предсердий — а значит, когда миокард сократится, выбросить много он не сможет.",
"Изменение в проведении электрического импульса ведет к грозным аритмиям — в сердце случаются короткие замыкания, ток блуждает по кругу, возбуждая миокард совсем не в том порядке, в котором надо. Так возникают экстрасистолы (добавочные желудочковые сокращения), а потом и желудочковые тахикардии и фибрилляция желудочков (желудочки перехватывают инициативу у синусового узла, как при добавочных желудочковых сокращениях, но делают это постоянно).",
"При варианте ГКМП с утолщенной перегородкой, есть еще одна проблема - она может частично перекрывать выход крови из левого желудочка в аорту (обструктивная форма). Это еще уменьшает количество крови, выбрасываемое левым желудочком, как при закрытии шланга одним пальцем. Бывает и необструктивная форма, когда препятствия нет, но утолщение есть. Например, при апикальной гипертрофии — эта форма считается доброкачественной, при ней меньше осложнений и проявлений."],
    Symptoms: ["Какие из-за этого возможны симптомы?", "Одышка: Сердцу сложнее расслабиться и наполниться кровью между ударами. Поэтому, несмотря на формальное увеличение мощности миокарда, он не обеспечивает увеличение потока крови при физической нагрузке (либо других состояниях, когда сердце должно больше работать - например, при инфекционных заболеваниях и эмоциональном стрессе).  То есть миокард не откачивает от легких столько же крови, сколько в них приходит, кровь в них застаивается и не насыщается кислородом. Ощущается как нехватка воздуха, тяжесть в груди, будто её сдавили обручем. Одышка — самое частое первое проявление болезни, именно с нее начинается поиск диагноза в 90% случаев.",
         "Стенокардия (боль в груди): Увеличенному миокарду необходимо большое количество крови, тем больше чем выше частота сокращений. Когда кислорода перестает хватать, возникает боль. Так происходит при атеросклерозе коронарных артерий — ишемической болезни сердца. И то же самое происхождение имеют боли при инфаркте. При ГКМП стенокардию может вызывать также один феномен — мышечные мостики. В норме коронарные артерии проходят по поверхности сердца, поэтому не сжимаются миокардом во время его сокращения. Однако мышечные мостики пережимают коронарные артерии, и к сердцу поступает меньше крови. Стенокардия является первым признаком в 25 - 30% случаев гипертрофической кардиомиопатии.", 
         "Сердцебиения:  Это ощущаемые аритмии - нарушение проведения или генерации электрических импульсов в сердце. Сердце начинает колотиться быстрее либо пропускает удары безо всяких причин. Могут также ощущаться добавочные сокращения (экстрасистолы) — как будто сердце сократилось слишком рано.  Среди всех аритмий самая частая(как и среди людей, не болеющих ГКМП) — фибрилляция предсердий.  Самыми опасными являются желудочковые аритмии — именно они являются причиной внезапной сердечно-сосудистой смерти.", 
         "Головокужения, туман в голове, потеря сознания (синкопе): Это следствие той же неспособности сердца обеспечить увеличение потока крови, только именно для мозга — ему перестает хватать кислорода. С синкопе гипертрофическая кардиомиопатия манифестирует  в 15-25% случаев, с пресинкопе — в 20%.", 
         "Усталость, слабость: Для нормальной работоспособности нужна кровь — кислород, питательные вещества, выведение метаболических шлаков. Поэтому чем меньше поток крови через орган, тем меньше он активен. Когда сердце не обеспечивает адекватное кровоснабжение, функциональные возможности тканей падают — так возникает чувство усталости и слабости.", 
         "Важно помнить, что эти симптомы проявляются не только при гипертрофической кардиомиопатии! Одышка может быть следствием болезней легких, стенокардия — той же ишемической болезний сердца, сердцебиения могут сопровождать тиреотоксикоз, а усталость, слабость и головокружения — быть следствием гиповитаминозов и анемии."],
    RedFlags: ["Когда стоит обратиться к врачу?", "Однако есть “красные флаги”, когда к врачу лучше обратиться раньше чем позже:", "Когда симптомы ухудшились за короткий период — появился новый вид сердцебиений, стала выраженней стенокардия (удается пройти без боли меньшее расстояние), одышка возникает быстрее чем раньше.", 
        "Когда симптомы стали сочетаться — сердцебиения стали сопровождаться одышкой или головокружением, это значит что аритмии стали значительно влиять на способность сердца качать кровь."],
    HowDiagnosed: ["Как диагностируется ГКМП?", "Очень важным пунктом является сбор анамнеза  — гипертрофическая кардиомиопатия является наследственным заболеванием. Причем тип наследования доминантный - это значит что достаточной одного поломанного гена из двух, чтобы болезнь проявилась. Важно обратить внимание на внезапные смерти — не всегда можно точно установить, что причина смерти была именно в гипертрофической кардиомиопатии. Внезапная аритмия провоцирует потерю сознания, и в этот момент может случиться многое — если человек находится в воде, то может утонуть, если на высотных работах — упасть и разбиться.",
        "Поэтому если выявляют гипертрофическую кардиомиопатию у одного члена семьи — обследуют всех."], 
    ObjExam: ["Объективное обследование", "Обструкция утолщенной перегородкой и неполное закрытие митрального клапана создаёт шумы, которые может услышать врач при аускультации сердца. Также может обнаружится особая форма пульса — “шпиль и купол”."], 
    LabExam: ["Лабораторные исследования", "Врач может назначить обычные исследования — общий анализ крови, биохимический анализ крови, анализ мочи, коагулограмму. Это необходимо для выявления сопутствующих проблем — например, если есть изменения в работе печени или почек необходимо пересчитывать дозировки препаратов.",
        "Также можно оценить уровень Nt-proBNP и сердечных тропонинов — высокие уровни свидетельствуют о большем риске сердечной недостаточности и неблагоприятном прогнозе."], 
    InstrExam: ["Инструментальные исследования", ""],
    ECG: ["Электрокардиография (ЭКГ)", "Является одним из самых чувствительным методов — изменения присутствуют в 90% случаев.  Более того, если изменений нет, либо они не очень заметны, прогноз будет благоприятный.",
        "ЭКГ рекомендуется проходить раз в 1-2 года, после операций и других вмешательств (например, коронароангиографии), при подборе терапии и ухудшении симптомов."
    ],
    EchoKG: ["Эхокардиография (ЭхоКГ)", "Позволяет узнать много полезной информации:",
        "Измерить толщину перегородки (патологическая — >15мм).",
        "Увеличение левого предсердия — большое предсердие означает высокий риск фибрилляции.",
        "GLS (global longitudinal strain), ФВ (фракция выброса) — позволяют оценить риск развития сердечной недостаточности.",
        "Градиент систолического давления (патологический > 30 мм рт. ст.) — в покое либо во время нагрузки. Влияет на лечение и прогноз.",
        "Результаты ЭХО-КГ зависят от специалиста, аппарата и состояния организма в данный момент, поэтому не стоит ориентироваться на небольшие изменения. Врачи могут отправлять на повторное исследование к тем, кому они доверяют."
    ],
    MRI: ["Магнитно-резонансная томография (МРТ)", "Позволяет увидеть более точную картину, чем Эхо-КГ, что особенно полезно перед операцией для выбора метода операции. Может выполняться с контрастированием гадолинием — так можно отличить гипертрофическую кардиомиопатию от фенокопий — например, болезни Фабри. Также контрастирование полезно, чтобы оценить наличие фиброза.",
        "Если есть ИКД (имплантируемый кардиовертер-дефибриллятор) или ЭКС (электрокардиостимулятор) — МРТ может быть противопоказана, это зависит от модели устройства. Однако есть много альтернатив."
    ],
    Holter: ["Холтеровское мониторирование","Это метод, заключающийся в непрерывной регистрации ЭКГ. Необходим для определения существующих аритмий (особенно опасны пробежки желудочковых тахикардий) и риска внезапной сердечно-сосудистой смерти.",
        "Полезнее 48 - 72 часов, хоть это причиняет больше неудобств. За 24 часа можно не отловить нужный эпизод аритмий. Если есть симптомы — то до тех пор пока симптомы не появятся.",
        "Врач может назначать это исследование в тех же ситуациях, что и обычное ЭКГ — каждые 1-2 года, после операций, во время подбора терапии."
    ],
    GeneticTest: ["Генетическое тестирование", "Сейчас известно много мутаций, вызывающих гипертрофическую кардиомиопатию. При этом тестировании можно обнаружить конкретный вариант, послуживший причиной болезни. Пока не так много данных, как разные мутации влияют на течение — оно индивидуально у каждого носителя. Поэтому лечение, скорее всего, не поменяется.", 
        "Но знать ген очень важно для определения его носителей среди родственников, у которых болезнь пока не проявилась. Также это может помочь отличить настоящую ГКМП от других генетических болезней, проявляющихся в том числе увеличением сердца."],
    Progress: ["Как может развиваться заболевание (варианты прогрессирования)?", 
        "Течение ГКМП очень непредсказуемо и разное у всех. Условно можно выделить несколько сценариев:",
        "Стабильное, бессимптомное течение: У многих людей ГКМП десятилетиями не прогрессирует и не вызывает серьезных проблем. Требуется лишь регулярное наблюдение.",
        "Прогрессирование симптомов: Со временем могут усиливаться одышка, усталость, боли в груди. Это может потребовать изменения терапии.",
        "Развитие сердечной недостаточности: Из-за постоянной жесткости мышцы сердце хуже наполняется кровью. Это называется диастолической сердечной недостаточностью. Симптомы: нарастающая одышка, отеки, снижение переносимости нагрузок.",
        "Появление жизнеугрожающих нарушений ритма: Самое опасное осложнение — фибрилляция желудочков, приводящая к внезапной смерти. Риск повышен, но его можно оценить и принять соответствующие меры. Другая частая аритмия — фибрилляция предсердий, которая повышает риск инсульта.",
        "«Переход» в стадию «выгорания»: У небольшого процента пациентов (чаще в пожилом возрасте) утолщенная мышца со временем может истончаться, терять силу и растягиваться, приводя к сердечной недостаточности (сердце плохо качает кровь). В этой стадии лечение схоже с терапией других видов сердечной недостаточности."],
    Ending: ["Что делать дальше?",
        "Не паниковать. Диагноз ГКМП — не приговор. С ним можно и нужно жить полноценной жизнью.",
        "Найти «своего» кардиолога, желательно в специализированном центре, где есть опыт ведения пациентов с кардиомиопатиями.",
        "Строго следовать плану лечения, который может включать лекарства (бета-блокаторы, блокаторы кальциевых каналов, антиаритмики), ограничение интенсивных физических нагрузок, установку кардиовертера-дефибриллятора (ИКД) для профилактики внезапной смерти или хирургическое лечение (септальная миэктомия) для устранения препятствия току крови.",
        "Регулярно наблюдаться: Проходить осмотры и контрольные обследования по графику, назначенному врачом.",
        "Сообщить ближайшим родственникам о необходимости обследования.",
        "Главное — партнерство с врачом, понимание своего состояния и ответственное отношение к лечению и образу жизни. Это ключ к долгой и активной жизни с гипертрофической кардиомиопатией."
    ]
}

export const dataSymptoms = [
    {
      id: 1,
      title: "Одышка",
      content: "Сердцу сложнее расслабиться и наполниться кровью между ударами. Поэтому, несмотря на формальное увеличение мощности миокарда, он не обеспечивает увеличение потока крови при физической нагрузке (либо других состояниях, когда сердце должно больше работать - например, при инфекционных заболеваниях и эмоциональном стрессе).  То есть миокард не откачивает от легких столько же крови, сколько в них приходит, кровь в них застаивается и не насыщается кислородом. Ощущается как нехватка воздуха, тяжесть в груди, будто её сдавили обручем. Одышка — самое частое первое проявление болезни, именно с нее начинается поиск диагноза в 90% случаев.",
      category: "Симптомы",
      img: ""
    },
    {
      id: 2,
      title: "Стенокардия (боль в груди)",
      content: "Увеличенному миокарду необходимо большое количество крови, тем больше чем выше частота сокращений. Когда кислорода перестает хватать, возникает боль. Так происходит при атеросклерозе коронарных артерий — ишемической болезни сердца. И то же самое происхождение имеют боли при инфаркте. При ГКМП стенокардию может вызывать также один феномен — мышечные мостики. В норме коронарные артерии проходят по поверхности сердца, поэтому не сжимаются миокардом во время его сокращения. Однако мышечные мостики пережимают коронарные артерии, и к сердцу поступает меньше крови. Стенокардия является первым признаком в 25 - 30% случаев гипертрофической кардиомиопатии.",
      category: "Симптомы",
      img: ""
    },
    {
      id: 3,
      title: "Сердцебиения",
      content: "Это ощущаемые аритмии - нарушение проведения или генерации электрических импульсов в сердце. Сердце начинает колотиться быстрее либо пропускает удары безо всяких причин. Могут также ощущаться добавочные сокращения (экстрасистолы) — как будто сердце сократилось слишком рано.  Среди всех аритмий самая частая(как и среди людей, не болеющих ГКМП) — фибрилляция предсердий.  Самыми опасными являются желудочковые аритмии — именно они являются причиной внезапной сердечно-сосудистой смерти.",
      category: "Симптомы",
      img: ""
    },
    {
      id: 4,
      title: "Головокужения, туман в голове, потеря сознания (синкопе)",
      content: "Это следствие той же неспособности сердца обеспечить увеличение потока крови, только именно для мозга — ему перестает хватать кислорода. С синкопе гипертрофическая кардиомиопатия манифестирует  в 15-25% случаев, с пресинкопе — в 20%.",
      category: "Симптомы",
      img: ""
    },
    {
      id: 5,
      title: "Усталость, слабость",
      content: "Для нормальной работоспособности нужна кровь — кислород, питательные вещества, выведение метаболических шлаков. Поэтому чем меньше поток крови через орган, тем меньше он активен. Когда сердце не обеспечивает адекватное кровоснабжение, функциональные возможности тканей падают — так возникает чувство усталости и слабости.",
      category: "Симптомы",
      img: ""
    }
  ];

  export const dataExams = [
    {
      id: 1,
      title: "Объективное обследование",
      content: "Обструкция утолщенной перегородкой и неполное закрытие митрального клапана создаёт шумы, которые может услышать врач при аускультации сердца. Также может обнаружится особая форма пульса — “шпиль и купол”.",
      category: "Объективное обследование",
      img: stetoscope
    },
    {
      id: 2,
      title: "Лабораторные исследования",
      content: "Врач может назначить обычные исследования — общий анализ крови, биохимический анализ крови, анализ мочи, коагулограмму. Это необходимо для выявления сопутствующих проблем — например, если есть изменения в работе печени или почек необходимо пересчитывать дозировки препаратов.",
      category: "Лабораторные исследования",
      img: analysis
    },
    {
      id: 3,
      title: "Электрокардиография (ЭКГ)",
      content: "Является одним из самых чувствительным методов — изменения присутствуют в 90% случаев.  Более того, если изменений нет, либо они не очень заметны, прогноз будет благоприятный. \n ЭКГ рекомендуется проходить раз в 1-2 года, после операций и других вмешательств (например, коронароангиографии), при подборе терапии и ухудшении симптомов.",
      category: "Инструментальные исследования",
      img: ECG1
    },
    {
      id: 4,
      title: "Эхокардиография (ЭхоКГ)",
      content: "Позволяет узнать много полезной информации: \n Измерить толщину перегородки (патологическая — >15мм).\n Увеличение левого предсердия — большое предсердие означает высокий риск фибрилляции. \n GLS (global longitudinal strain), ФВ (фракция выброса) — позволяют оценить риск развития сердечной недостаточности. \n Градиент систолического давления (патологический > 30 мм рт. ст.) — в покое либо во время нагрузки. Влияет на лечение и прогноз. \n Результаты ЭХО-КГ зависят от специалиста, аппарата и состояния организма в данный момент, поэтому не стоит ориентироваться на небольшие изменения. Врачи могут отправлять на повторное исследование к тем, кому они доверяют.",
      category: "Инструментальные исследования",
      img: Echo1
    },
    {
      id: 5,
      title: "Магнитно-резонансная томография (МРТ)",
      content: "Позволяет увидеть более точную картину, чем Эхо-КГ, что особенно полезно перед операцией для выбора метода операции. Может выполняться с контрастированием гадолинием — так можно отличить гипертрофическую кардиомиопатию от фенокопий — например, болезни Фабри. Также контрастирование полезно, чтобы оценить наличие фиброза. \n Если есть ИКД (имплантируемый кардиовертер-дефибриллятор) или ЭКС (электрокардиостимулятор) — МРТ может быть противопоказана, это зависит от модели устройства. Однако есть много альтернатив.",
      category: "Инструментальные исследования",
      img: MRI1
    },
    {
      id: 6,
      title: "Холтеровское мониторирование",
      content: "Это метод, заключающийся в непрерывной регистрации ЭКГ. Необходим для определения существующих аритмий (особенно опасны пробежки желудочковых тахикардий) и риска внезапной сердечно-сосудистой смерти. Полезнее 48 - 72 часов, хоть это причиняет больше неудобств. За 24 часа можно не отловить нужный эпизод аритмий. Если есть симптомы — то до тех пор пока симптомы не появятся. \n Врач может назначать это исследование в тех же ситуациях, что и обычное ЭКГ — каждые 1-2 года, после операций, во время подбора терапии.",
      category: "Инструментальные исследования",
      img: holter
    },
    {
      id: 7,
      title: "Генетическое тестирование",
      content: "Сейчас известно много мутаций, вызывающих гипертрофическую кардиомиопатию. При этом тестировании можно обнаружить конкретный вариант, послуживший причиной болезни. Пока не так много данных, как разные мутации влияют на течение — оно индивидуально у каждого носителя. Поэтому лечение, скорее всего, не поменяется. \n Но знать ген очень важно для определения его носителей среди родственников, у которых болезнь пока не проявилась. Также это может помочь отличить настоящую ГКМП от других генетических болезней, проявляющихся в том числе увеличением сердца.",
      category: "Инструментальные исследования",
      img: ""
    }
  ];