export const history = [
    {
        id: 1,
        creator: 'Сергей К.',
        content: <div>
            <p>
                В 41 год меня ожидал неприятный сюрприз - диагноз "обструктивная ГКМП - гипертрофическая кардиомиопатия 
                с обструкцией выносящего тракта". Предстояла сложная операция на открытом сердце. Мне хотелось найти людей 
                с таким же диагнозом, которые уже прошли этот путь. Узнать, удалось ли победить болезнь, подробности операции, 
                как живут после неё, куда бежать и что делать. Оказалось, сложно их найти. Создавая <a href="https://t.me/GKMPchat">этот форум</a>, хочу чтобы у 
                каждого была такая возможность. Сейчас уже всё позади, после моей операции прошёл почти год. Готов поделиться 
                информацией, которой мне тогда сильно не хватало. Ниже моя история. Спрашивайте что интересует, отвечу всем. 
                Если Вы в похожей ситуации, но с другим диагнозом, создавайте <a href="https://t.me/GKMPchat">на форуме</a>, новую тему по названию 
                заболевания.
            </p>
            <p>
                До операции: занимаюсь спортом всю жизнь (не профессионально) - футбол, тренажёрка, плавание, пробежки иногда, разные активности. ЗОЖ, не пью и 
                не курю с 30 лет (в 2021 году мне было 41). В августе 2021 года как обычно играл в минифутбол в зале. Меня спросили почему я быстро заменился, 
                ведь вышел на поле недавно. Ответил - я почему-то задыхаюсь, не пойму что такое. Так как вокруг царил ковид, пошёл проверять лёгкие, где был 
                выявлен некий 6% "очаг поражения". Но он явно не мог так влиять на моё дыхание, я не болел и чувствовал в целом себя отлично. Записался на приём 
                к пульмонологу, который слушая меня через фонендоскоп спросил "а это что за порок сердца?" На что я возмущенно ответил, что 40 лет занимаюсь спортом, 
                постоянно хожу по врачам с профилактической целью, всё обследую, и Вы первая кто говорит что у меня что-то не так с сердцем. В общем, засомневался в её 
                профпригодности. Насчёт 6% поражения - предположила "ТЭЛА" - тромб в лёгком. Мне сняли кардиограмму. Пока снимали, мне не понравились удивлённые лица врачей 
                (не кардиологи). Сказали сидеть не двигаться, что у меня предынфарктное состояние и вызвали скорую. Далее долго возили по больницам, ТЭЛА не подтвердилась. 
                На следующий день пошёл спокойно обследовать сердце - УЗИ, кардиограмма. Поставили диагноз - обструктивная ГКМП. Конечно была стадия отрицания, что такого 
                диагноза у меня не может быть, это всё ошибка. Тем более я слежу за своим здоровьем, занимаюсь спортом всю жизнь. Начал изучать болезнь. Вспомнил про папиного 
                брата-близнеца, который внезапно умер в 39 на рабочем месте, будучи всю жизнь активным и спортивным человеком. Понял причину своей странной одышки вечером при 
                восстановлении после игр в футбол, когда хочется на балкон подышать и давит в груди. Сильно заметного ограничения функционала у меня не наблюдалось, но явно 
                было что-то не то. Небольшое дурноватое ощущение в груди появлялось даже просто при интенсивной ходьбе. Но раньше я не придавал этому значения. 
                Из всех сердечников, с кем я познакомился впоследствии, мало кто сразу понял, что дело в сердце. Кто грешил на лёгкие, кто на курение, на что угодно, 
                но вначале никто обычно не догадывается, что причина в сердце. Запрет любых физических нагрузок кроме ходьбы звучал трудновыполнимо. Непонятно, 
                как я смогу теперь без любимого футбола, тренажёрки и подводной охоты. Напомню, живу я в Ярославле, здесь медицина довольно развита. Пошёл в ещё одно хорошее
                 медицинское учреждение, ни говоря им ни слова о диагнозе, "просто обследоваться". Диагноз мне подтвердили, немного ему удивившись. На вопрос что мне делать, 
                 сказали "мы можем только наблюдать за динамикой, в Москве это как-то оперируют, иссякают сердечную мышцу". Тогда это показалось мне диким, не реальным и 
                 "уж точно не про меня". Поинтересовался какое лучшее заведение в России по сердечным делам? Посоветовали Бакулева. Позвонил по номеру на сайте, записался на 
                 консультацию. Попросил чтобы меня проконсультировал зав. отделением. Готов был платить, так как понял, что дело серьёзное, а у меня трое деток. 
                 На консультацию привёз ворох исследований (к тому времени успел ещё сделать ангиографию в областной ярославской больнице), успели посмотреть 
                 бегло только итоговые заключения.
            </p>
            <p>
                На консультацию действительно, в порядке исключения, пришла зав. отделением (Марина Ивановна, огромное Вам спасибо), консультация стоила вроде 2 тыс руб. 
                всего. ( Порекомендовали госпитализацию для обследования, записали по очереди примерно через четыре месяца. Обследовали меня целую неделю, лежал в палате 
                на 6 человек, сделали в том числе МРТ сердца (тогда в Ярославле его не делали вообще), коронарографию, УЗИ через пищевод, различные холтеры и т.п. Итог
                 обследования: вообще, сказали, что хорошо бы мне вшить дефибрилятор. Но сейчас санкции, а они импортные, в наличии нет. Затем по какому-то их медицинскому 
                 калькулятору высчитали, что пока можно не вшивать. Так как физических ограничений у меня практически не было, и по лестницам я бегал, посомневались насчёт 
                 операции и решили пока понаблюдать, приезжать к ним раз в полгода на консультацию с результатами анализов, УЗИ, кардиограммой. На второй визит (т.е. 
                 через год после большого обследования) врач сказала мне что по показателям всё ухудшается и скоро я созрею на операцию. Операция предполагалась - то 
                 самое иссечение перегородки (в норме она 1 сантиметр, а у меня в самом широком месте была 2,1 см) и замена митрального клапана. Если правильно понимаю, 
                 он начинает неправильно работать как раз в результате гипертрофии сердечных мышц. К тому времени, УЗИ показывало ближе ко 2-й степени его недостаточности, 
                 что предполагает замену. Пока я лежал тогда неделю на обследовании, насмотрелся всякого про сердечные болезни и операции. Мне очень не нравилась перспектива замены клапана.
                  Там было много ребят с искусственным клапаном. Всё вроде бы ничего, но они пожизненно теперь должны пить варфарин - разжижающее кровь лекарство. Оказывается 
                  организм понимает что в нём что-то чужеродное и свёртывает кровь рядом с ним, т.е. образует тромбы. Варфарин должен устранять эту проблему. Но меня смутил 
                  разговор двух ребят. У одного жена медсестра, лет ему меньше 30-ти. Жена, как медик, знает симптомы инсульта и своевременно ловила их трижды, сразу вызывая скорую
                   - перекошенное лицо, временная потеря зрения на один глаз. Сам он не понимал что это инсульт. Второй сказал что тоже временно терял зрение на один глаз, но не 
                   придал этому значения. Отсюда я понял что варфарин не до конца решает проблему и тромбы всё равно образуются, сотворяя микроинсульты. Кроме того, первые две 
                   недели после замены клапана, они слышали щелчки створки искусственного клапана, которые даже мешали спать. Потом мозг их видимо "отключает, не слышит". Мне 
                   сильно повезло. Один очень хороший врач посоветовала мне обратиться к кардиохирургу Лысенко в институте Петровского. Сказала что он умеет оперировать ГКМП 
                   так, что клапан остаётся мой и его не приходится менять. Это очень меня обнадёжило. Вскоре я уже был на консультации у Лысенко Андрея Викторовича и была назначена операция.
            </p>
            <p>
                <b>Операция: Москва, Абрикосовский пер., д.2, РНЦХ имени Петровского.</b>
            </p>
            <p>
                Не было страха или беспокойства перед операцией. Страшнее внезапно умереть и оставить троих деток без средств к существованию, без защиты, в общем, без папы. Поэтому хотел 
                чтобы быстрее сделали и устранили этот риск. Саму ГКМП не устранят конечно, только опасное её проявление в виде обструкции выносящего тракта (перекрытие кровотока в аорту). 
                Отмечу что я ещё сравнительно много узнал о болезни, операции, так как читал и пытал расспросами докторов. Например, обход во главе с хирургом до операции. Закреплённый за 
                мной кардиолог ("лечащий врач"), описывая моё состояние, сыплет медицинскими терминами вроде "выраженного переднесистолического движения митрального клапана". На вопрос что 
                это такое - "да зачем это вам?" Как, говорю, это же происходит с моим сердцем, внутри меня, очень хочу всё понимать, расскажите пожалуйста. Мне не отказывали. В Бакулева поняли 
                что я за тип и дали книгу про ГКМП, предназначенную для врачей. К примеру один из прооперированных рядом утверждал по телефону друзьям, что ему вырезали и доставали сердце во 
                время операции.
            </p>
            <p>
                С собой мне заранее сказали привозить: 1. Все медицинские документы (в т.ч. диск с коронарографией, МСКТ, если есть); 2. Паспорт, полис, СНИЛС; 3. Свои вещи (одежду - после 
                операции лучше рубашку или халат; вещи личной гигиены - в т.ч. бритвенные принадлежности, посуду; 4. Таблетки, которые принимаете; 5. Нольпаза 40 мг (1 упаковку), диклофенак 
                25 мг/мл 20 ампул; эластичные бинты (2 шт по 5 м); надувной пляжный детский мячик диаметром 50 см.
            </p>
            <p>
                В больницу приехал за два дня до операции. Сделали ЭКГ, УЗИ. Палата на 6 человек, кто-то только что прооперирован, из реанимации, кто на обследовании, с разными диагнозами, 
                со всей России. Кормят также хорошо, как и в Бакулева, есть отличное кафе, люди тоже замечательные. Врач в Ярославле высказывала опасения - в Московских клиниках коррупция, 
                и т.п. Абсолютно не подтвердилось. Прекрасные люди, от Хирургов до уборщиц. Никто ни разу не намекнул на деньги, не вымогал, не вёл себя так что "хорошо бы отблагодарить", 
                не ограничивал меня в чём-то. Обычно я предпочитаю платную медицину (лучше скорость, качество, отношение). Но в этот раз, всё это чудо, которое я получил, было бесплатным, 
                по полису ОМС! И недельное обследование в Бакулева и безупречную операцию от одного из лучших мировых хирургов и недельную реабилитацию-восстановление в Ясенево. Лечат всех 
                вместе и одинаково хорошо, и алкоголика и предпринимателя. Вы не получите никаких преимуществ в лечении, пытаясь вручить кому-то деньги. Останавливаюсь на этом подробно, так как
                этот вопрос возникал у многих вновь пришедших. У нас действительно бесплатная медицина потрясающего уровня. Знакомый выкинул полтора миллиона на устранение аритмии свое жене в
                Германии, буду убеждённым что "у нас это считается ещё сложной операцией, а вот таам..." Аритмию при мне устраняли многим, без общего наркоза, эффективно и технологично.
                Также по полису ОМС. Но об этом подробнее Вам расскажут другие. Вечер перед операцией - гигиенические процедуры, на ночь какая-то таблетка. Жену сразу предупредил 
                что могут в реанимации продержать и двое, трое суток, значит так надо, не паниковать. Утром укол, увозят голого с простынкой на тележке. В операционной куча народа, 
                прохладно. Ставят катетеры, что-то делают... в следующий миг очнулся уже в реанимации, понимаю что уже всё сделано. Боли нет. Видят что дышу уже сам, убрали 
                дыхательную трубку, подходят, разговаривают, следят за состоянием. Андрей Викторович сам тоже подходил. Хочется пить, но не надо, будет сильно тошнить 
                сразу. Операцию делали кажется четыре с половиной часа. Утром на следующий день уже вернули в палату. Следующий день - ещё похоже не отошёл наркоза, пошатывало немного.
                Сказали ходить. Своё состояние сам оценивал как адекватное и даже великолепное. Отовсюду что-то торчит, катетеры, проводки, из живота две трубки дренажа и баночка для стоков. 
                Ноги замотаны эластичными бинтами, так видимо сердцу легче кровь качать. Кашлять и особенно чихать нужно очень аккуратно, обняв предварительно себя руками.
            </p>
            <p>
                Также аккуратно вставать с кровати, не опираясь на руки, подтягиваясь за специально привязанную верёвку. Нужно надувать мячик, расправлять лёгкие. Спать надо, но трудно 
                выспаться. Самое неудобство - спать только на спине, затекает очень быстро, ночью уже не знаешь куда себя деть, все сидят периодически. То укол то капельница то еда. 
                Рано-рано утром забавно звучало "доброе утро" от медсестры со шприцем в руке. Вокруг храпят. Но всё равно лучше в шестиместной палате, чем одному лежать. Как сказал 
                один хирург, на следующий день после операции обычно пациент в эйфории от того, что просто жив. А спустя время уже ему и шов кривоват, требования повышаются. 
                Контингент в палате разный - и молодые и в возрасте. Есть немой, есть профессиональный спортсмен, со всей России. Люди периодически меняются. 
                Второй день после операции - слабость. Наконец-то можно частично помыться. Пульс и давление после операции сразу изменились, стали непривычные, 
                "не мои". Но ближе к норме здорового человека. Работа сердца ощущается по-другому: лёжа на спине будто покачивает из стороны в сторону при каждом сокращении. 
                Сходил до кафе внизу, попробовал подняться по лестнице - зашёл на третий этаж и всё, одышка, до операции такой не было.
            </p>
            <p>
                Третий день - контрольные ЭКГ, УЗИ и ЭХО. Все дни взвешивают, берут кровь, делают уколы, контролируют давление, пульс и водный баланс. Пить можно строгое количество 
                граммов воды в сутки, включая суп и др. Это важно, чтобы не было опасного отёка. Нужно контролировать себя, не опираться на руки, осторожно вставать и т.п. 
                Андрей Викторович в корсет после операции не одевает, грудину стягивают титановыми нитями. Без корсета лучше, но рассчитывают на осознанность и осторожность. 
                Четвёртый день - из торчащего из меня остались только, тонкие проводки из живота в синей изоляции. Я так понял, что ведут к сердцу и нужны для экстренной реанимации, 
                в случае чего, после операции. Их не убирают, только подрезают у кожи и прячут вовнутрь. Становится всё лучше. Пятый день - отрезали и их и последние нитки от дренажных 
                отверстий. Сам шов "косметический", нити рассасываются сами в течение месяца, закрыт специальной наклейкой типа марли, которую меняли раз в день. Уже можно не заклеивать. 
                Многие спрашивают про инвалидность, дадут ли теперь. На что отвечают - вообще то мы здесь наоборот, из инвалидов делаем здоровых людей. Кому положено, конечно оформляют 
                всё что нужно. Одежда, бельё - рассчитайте сколько надо, стирки там нет. Шестой день - выписывают в другое заведение, на реабилитацию.
            </p>
            <p>
                <b>
                    Реабилитация (долечивание): Научно-клинический центр № 2 РНЦХ им. акад. Б.В. Петровского Литовский бул., 1А.
                </b>
            </p>
            <p>
                Шестой день после операции. Перевозили меня примерно в обед, на скорой с мигалками. Не очень удачно переехал, процесс плохо организован. Сразу проводили в скорую. 
                А при поступлении я сдавал верхнюю одежду и чемодан, спешно пошёл за ними. Но самое главное - здесь не успели покормить, а там довольно долго оформляли, 
                плюс в шортах замёрз. Врачи осматривали при поступлении, отметили что я очень бледный. Действительно чувствовал себя не очень. Давление поднялось, 
                мне дают документы подписать, а я не вижу что там, в глазах мерцает. Возможно от голода или бессоницы ещё. Организм требовал строительного материала
                для ремонта. Да ещё и железа в нём сильно не хватало из-за кровопотерь. "Можно лёжа буду с Вами беседовать? Мне плохо". - "Лучше сидя", говорит... 
                Врачи все очень молодые, на некоторые вопросы не могут ответить. Всем развезли обед, а меня "ещё нет в списках". Мне было совсем дурно, 
                чувствовал что срочно нужно найти еду. Повезло что есть кафе в здании, по распросам нашёл, всего накупил и наелся. Здесь уже 
                больше было похоже на санаторий. Не палата, а скорей номер, на двоих. Сосед оказался таксист с диабетом, не по кардиологии 
                совсем сюда попал. Кормят тоже хорошо, строго по расписанию. Удивился что могу легко до утра без перекусов после ужина в 18.00. 
                Встретил всех кто был со мной в прошлой палате. Все чувствовали себя нормально, кроме одного. Температура и показатели не очень. 
                Всю неделю процедуры с сомнительной эффективностью - кладут квадратики на плечи, якобы лазерное прогревание, вообще никаких ощущений. 
                Пенсионерские физические упражнения в группах. Ну ладно, хоть какое-то развлечение. В лёгких ещё осталась вода, за ней следят. Но немного, 
                грамм 200 всего по УЗИ. Со шва почти сразу сняли повязку, нанесли прозрачный клей, который смывается водой через 6 дней. Неплохая территория, 
                можно погулять во дворе. Рядом невероятный Битцевский парк, здорово гулять по нему. На второй день реабилитации (седьмой после операции) вышел 
                за территорию прогуляться. Страшновато ещё, нет уверенности, мало ли что пойдёт не так, вернулся. Через день после этого позволил себе 
                вылазку с товарищем аж до кафе на проспекте, взял там кофе. На спине по-прежнему спать нельзя, опираясь на руки не вставать, 
                двери не толкать, руки не нагружать, тяжести не носить, грудину не перекашивать. Нужно себя контролировать. 12-й день после операции, 
                выписали. С собой дали сомнительную инструкцию по поведению после операции и питанию (прикрепил скан). Сам, с чемоданом на колёсиках, 
                добрался домой в Ярославль. Встречать из больницы не понадобилось никому - такси, поезд. На следующий день уже был в офисе, на работе, 
                ненадолго. Коллеги удивились, предположили что мне ничего и не делали.
            </p>
            <p>
                Восстановление: Больничный я не оформлял, мне не нужен. В плане работы (офисная) - продолжил полноценно заниматься всем что делал до 
                операции. Поначалу может чуть быстрее уставал. Неудобства доставляет только сон на спине, месяц или два уже не помню. Физически понятно 
                что нагружаться нельзя. Ходить - да, обязательно, хорошо бы пять километров в день минимум. Спустя полгода после операции полное срастание 
                грудной клетки, снова пошёл на футбол. Сначала в воротах играл, но спустя месяц начал бегать полевым игроком. Мышцы ног сразу забились, 
                давно не было у них нагрузки. Но со временем натренировались, и стало всё хорошо. Ни одышки ни дурного ощущения в груди, всё отлично. 
                Русская баня с друзьями - тоже возобновил. Сначала лучше сильно не греться и не париться, появлялись некоторые ощущения в сердечке. 
                Но сейчас, спустя год, не ограничиваю ни температуру ни продолжительность, всё отлично. В инструкции, которую выдают после операции, 
                ограничения прямо прописаны только для тех, кто делал шунтирование. Из странного - потеря чувствительности в левой голени на несколько 
                месяцев. Не знаю, связано ли это с операцией, возможно просто совпало. В больнице брали кровь на генетический тест. При обнаружении 
                моего "неправильного" конкретного гена, по накопленному опыту, врачи бы знали как будут далее развиваться события. Спустя для несколько 
                месяцев пришли результаты, ген не найден. Сказали что анализируются самые популярные из них, у меня значит другой ответственен за ГКМП. 
                Отца отправил на УЗИ, показало небольшое утолщение перегородки до 1,4 см. Никак себя не проявляло. Детей всех проверил, всё хорошо.
            </p>
            <p>
                Спустя год, ощущаю себя полностью здоровым человеком. В футбол пока не играю, но уже по другой причине - травма коленных связок. Про 
                операцию и ГКМП, можно сказать, забыл совсем. Только шрам на груди иногда ненавязчиво напоминает, что всё это происходило в реальности.
            </p>
            <p>
                Во время обследования коронарных сосудов в Бакулева было выявлено их перекрытие в некоторых местах до 30 и 40 процентов холестериновыми 
                отложениями. Кровь сдаю регулярно и знаю что мой холестерин зашкаливает. На фоне своей обструктивной ГКМП вообще не обратил внимания 
                на эту информацию в выписном эпикризе, не придавал этому значение. Лишь позже меня осенило, что наверное лет через 10-15, если ничего 
                не буду с этим делать, приеду сюда же, но уже на шунтирование. По рекомендации из Петровского, впоследствии поехал разбираться с этим 
                к липидологам. Но это уже совсем другая история. Из таблеток, которые регулярно пью - бисопролол 5 мг и статины. Скоро на приём к 
                Андрею Викторовичу спустя год после операции. Возможно отменит и бисопролол.
            </p>
            <p>
                <b>Огромная благодарность Житковой Ольге Николаевне - кардиологу "Паритет" г. Ярославль. Крапчиной Валентине Александровне, Ивлевой 
                    Ольге Викторовне, Хугаевой Алине Ахсарбековне - кардиологам (Бакулева), Берсенёвой Марине Ивановне - зав отделением (Бакулева), 
                    Лысенко Андрею Викторовичу - прооперировавшему меня хирургу (Петровского, зав отделением), его заместителю Ледневу Павлу Владимировичу, 
                    Ирине Олеговне Демьяновой - кардиологу (Петровского). И ещё раз Лысенко Андрею Викторовичу. Спасибо!!!</b>
            </p>
            <p>
                <b>28 октября 2024:</b> к Андрею Викторовичу пока не попадаю, полная запись, свободных часов нет. Сказали звонить 11 ноября. Пока 
                для консультации сделал холтер в Ярославле и обычную кардиограмму. На холтере впервые замечен короткий эпизод желудочковой 
                аритмии ("короткий пароксизм неустойчивой желудочковой тахикардии из 4 комплексов с ЧСС до 160 в мин") 2 секунды. Если правильно понимаю, 
                той самой, от которой внезапно умирают. А также "в ночные часы - эпизоды преходящей АV-блокады I степени", которая похоже и есть причина 
                этой опасной аритмии.Во время аритмии я был в абсолютном физическом покое и не ощутил её. Повторный холтер решили поставить в декабре. 
                Появились новые ощущения легкого периодического понывания в сердце. Всё это вызывает серьёзное беспокойство.
            </p>
            <p>
                <b>Продолжение истории: </b>нагрузочный тест (стресс-ЭХО -КГ) делали три врача одновременно, в полулежачем положении крутишь педали, постепенно
                 добавляют нагрузку, постоянно снимается ЭКГ, смотрят ЭХО, контролируются все показатели. Трудновато достичь пульса 150, учитывая спортивное 
                 прошлое и бисопролол. Результаты хорошие. Генетическое исследование: в Бакулева был бесплатный анализ на самые популярные гены, мутации 
                 не выявлено. Сдал платно в компании Генетико на все гены сердца (~80), стоит 35 тыс руб. Кровь сдавал удалённо, у себя в Ярославле. Делают 
                 90 дней по договору. Но до сих пор нет результата, какие-то сложности с импортными материалами для работы, жду. По табличке вероятности 
                 внезапной сердечной смерти я по-прежнему в зоне повышенного риска, в которой рекомендована установка ИКД (имплантируемого кардиовертера дефибриллятора). 
                 Вероятность определили как 6,44% в течение ближайших пяти лет. Установка прибора была назначена в "НМИЦ ТПМ" на 21 апреля 2025. 
                 Еле дождался этой даты. Было страшно умереть в любой момент, ночи не спал, прислушивался к ритму. В моём случае подошёл так называемый 
                 подкожный тип ИКД. Довольно приличная шайба и длинный электрод от неё. Операция была под общим наркозом. Мне она показалась очень 
                 лёгкой по сравнению с предыдущей операцией по иссечению перегородки на открытом сердце. Делал Абдуллаев Руслан Мурадович. 
                 Очень аккуратно и деликатно всё. Потрясающе. Спасибо! Вообще подметил особенность врачей НМИЦ ТПМ - отсутствие профессионального цинизма, 
                 особая какая-то эмпатичность к пациентам, вежливость. Из интересного: перед операцией меня пристегнули к лежанке. Оказалось не "чтобы не сбежал", 
                 а сразу после установки тестируют прибор - инициируют ту опасную аритмию и смотрят правильно ли сработает и восстановит ли ритм. Ожидал 
                 что будет разрез вокруг грудной мышцы для электрода. Ничего подобного. После обнаружил лишь два небольших надреза - один примерно десять 
                 сантиметров ниже левой подмышки, через него засунули шайбу (сам прибор) под широчайшую мышцу. Другой короткий разрез ближе к 
                 солнечному сплетению, видимо там надо было развернуть электрод вверх чтобы просунуть дальше. Снаружи груди ничего не видно и 
                 почти не прощупывается. Шайба конечно выпирает ровным кружком, но это только если стараться показать её - взять левой рукой 
                 правое плечо. Обезболивающие мне даже не понадобились больше, в первую же ночь после операции уже обошёлся без них. 
                 Дальше будут незначительные болевые ощущения при некоторых движениях, изредка, пока всё там приживается, примерно в течение месяца. 
                 Сейчас прошло три месяца, я подтягиваюсь, отжимаюсь, ничего не мешает совершенно, даже не вспоминаю про прибор. Теперь 
                 вздохнул с облегчением, в случае чего прибор меня спасёт.
            </p>
        </div>
    }
]