export const news = [
    {
        id: 1,
        title: 'Встреча-презентация сайта',
        content: <div>
            Запланирована на 14.04, 18:00. Покажем и расскажем, а также 
            с удовольствием ответим на Ваши вопросы! 
            <p></p>
            <button className="buttonNonActive"> Здесь будет ссылка на встречу. Формат - ЯндексТелемост.</button>
        </div>,
        date: '30.03.26'
    },
    {
        id: 2,
        title: 'Создание сайта',
        content: 'Сайт был создан.',
        date: '20.12.25'
    }
]