import ICD from '../../data/images/ICD.jpg';
import ECS from '../../data/images/ECS.jpg';
import myoectomia from '../../data/images/septalnaya-myoectomia.jpg';
import ablation from '../../data/images/ablation.jpg';
import drug from '../../data/images/drugs.jpg';


export const drugs = [
    {
        id: 1,
        title: "Бета-блокаторы",
        content: <div>Это препараты, которые блокируют рецепторы адреналина и норадреналина. 
            Но не все — в организме есть разные классы, и бета-блокаторы ,исходя из названия, блокируют бета-рецепторы. 
            Среди них есть подкласса - бета-2 и бета-1. И соответственно тому, блокирует препарат оба типа или один, 
            он назвается неселективным или селективным.Так как эти лекарства — антагонисты адреналина и норадреналина, 
            то при их применении действие этих гормонов на кровеносную систему будет уменьшаться. 
        А значит замедляться частота, сила сокращений и снижаться давление. 
        Это уменьшит нагрузку на сердце и позволит ему сокращаться  спокойно, увеличивая его наполнение между ударами. 
        Поэтому эти препараты уменьшают одышку, боль в груди и сердцебиения. 
        <p>Побочные эффекты бета-блокаторов связаны с их действием — так как они уменьшают работу сердца и мешают адреналину тонизировать организм, 
            то могут стать более холодными руки и ноги, появится слабость, прийти лишний вес, в редких случаях возникает депрессия. 
            Поэтому эти лекарства с осторожностью применяют при заболеваниях сосудов конечностей (например, болезни Рейно). Также нужно быть внимательным, 
            если есть диабет — неселективные бета-блокаторы делают симптомы гипогликемии менее заметными (это связано с наличием бета2-рецепторов в печени), 
            и если есть астма — те же бета2-рецепторы имеются и в бронхах (адреналин расширяет их), поэтому неселективные бета-блокаторы могут спровоцировать приступ астмы. 
            С побочными эффектами борются подбором дозы, если не помогает — можно сменить схем терапии.</p>
        <p>Важный момент — лекарства нельзя резко прекращать принимать. Во время приема препаратов организм перестраивается — увеличивается количество блокируемых бета 
            рецепторов, поэтому в момент отмены адреналин и норадреналин начнут действовать даже больше обычного, сильно ухудшив симптомы.</p>
        <p>Вот список применяющихся в России бета-блокаторов — в скобках указаны примеры торговых названий:</p>
        <ul>
            <li>Метопролол (Беталок ЗОК) — селективный.	</li>
            <li>Бисопролол (Конкор) — селективный.</li>
            <li>Небиволол (Небиволол-СЗ) — селективный.</li>
            <li>Пропранолол (Анаприлин) — неселективный.</li>
        </ul>
        </div>,
        category: "Лекарства",
        img: drug
    },
    {
        id: 2,
        title: "Блокаторы кальциевых каналов",
        content: <div>Кальций нужен сердцу и гладким мышцами сосудов, чтобы сокращаться, 
            а также одним из ионов, отвечающих за проведение электического тока по сердцу. 
            Ингибируя вход кальция, блокаторы кальциевых каналов расслабляют сердце и артерии, 
            снижая давление и работу сердца. Причем также замедляют проведение импульса от предсердий 
            к желудочкам — урежают сердечный ритм. Эти препараты разделяются на три группы — 
            действующие преимущественно на сердце, преимущественно на сосуды и действующие на то и другое одновременно. 
            Действующие на сосуды при ГКМП не рекомендуются, так как не влияют на наполнение сердца и в то же время снижают 
            артериальное давление, заставляя сердце рефлекторно биться чаще.
            <p>Их эффекты схожи с бета-блокаторами — уменьшение одышки, боли в груди и сердцебиений. 
                Однако из-за частичного синергизма этих препаратов их не рекомендуют назначать вместе. 
                Из побочных эффектов наиболее часто возникает констипация — так как кальций активирует и гладкие мышцы кишечника. 
                С ней также борются подбором дозы.
            </p>
            <p>Список блокаторов кальциевых каналов:</p>
        <ul>
            <li>Верапамил (торговое название то же) — действует на сердце.	</li>
            <li>Дилтиазем (торговое название то же) — действует на сердце и сосуды.</li>
        </ul>
        </div>,
        category: "Лекарства",
        img: drug
    },
    {
        id: 3,
        title: "Диуретики",
        content: <div>Их существует много классов и много ньюансов применения. 
            Действие диуретиков направлено на выведение лишней жидкости из организма — 
            когда сердце плохо работает, кровь в венах застаивается и образуется затор — 
            часть плазмы из кровеносного русла перемещается в ткани, так образуются отеки. 
            Диуретики являются компонентом лечения сердечной недостаточности — это проблема 
            не только пациентов с ГКМП, но и перенесших много инфарктов, с плохо работающими клапанами, а также многих других. 
        </div>,
        category: "Лекарства",
        img: drug
    },
    {
        id: 4,
        title: "Антиаритмики",
        content: <div>Антиаритмики — очень разнородная группа. 
            На самом деле бета-блокаторы и блокаторы кальциевых каналов, которые уже упоминались — тоже антиаритмики. 
            Однако они выделены отдельно из-за целей, для которых они используются.
            <p>Самая частая причина назначения антиаритмиков — фибрилляция предсердий. 
                При ней в России чаще всего применяется амиодарон — он действует на очень большое каналов и рецепторов, поэтому приводить их здесь не будем. 
                Очень полезный препарат, который помогает устранить симптомы фибрилляции — чаще всего это сердцибиения. 
                Однако обладает множеством побочных эффектов, из-за которых необходим тщательный мониторинг функции щитовидной железы, 
                лёгких, печени и регулярная запись ЭКГ.  Несмотря на количество и серьёзность побочных эффектов, 
                его принимают большое количество людей (фибрилляция предсердий — самое часто встречающееся нарушение ритма)— 
                частота возникновения каждого из них невелика. 
                Амиодарон — рекомендуемый российскими рекомендациями препарат. 
                В зарубежных рекомендациях (AHA и ESC) упомянуты и другие препараты — дизопирамид, 
                дофетилид, флекаинид, соталол и дронедарон. Однако в связи с меньшей эффективностью и 
                наличием не менее серьезных побочных эффектов они используются редко. 
            </p> 
            <p>Для лечения других видов аритмий используют имплантируемые устройства — 
                электрокардиостимулятор либо имплантируемый кардиовертер- дефибриллятор.</p>
        </div>,
        category: "Лекарства",
        img: drug
    },
    {
        id: 5,
        title: "Антикоагулянты",
        content: <div>Препараты, мешающие образованию тромбов. Не относятся к базовому лечению ГКМП — назначаются только если есть состояния, 
            увеличивающие риск образования тромбов. При гипертрофической кардиомиопатии наиболее часто такими состояниями являются 
            фибрилляция предсердий, трепетание предсердий и замена клапанов (из-за возникшей митральной недостаточности).
            <p>Как кровь свёртывается? В ней есть тромбоциты и специальные белки, по специальному сигналу соединяющие тромбоциты между собой. 
                Вместе они создают тромб, залатывающий прореху в стенке сосуда. Специальный сигнал, активирующий этот процесс, 
                также опосредуется белками, которые можно ингибировать. Это и делают антикоагулянты.  
            </p> 
            <p>Есть 2 группы антикоагулянтов, которые могут назначить — прямые оральные антикоагулянты 
                (ПОАК) и антагонисты витамина K. ПОАК называются прямыми, так как воздействуют на сигнальные белки свёртывания — 
                в отличие от них антагонисты витамина K действуют на их синтез, происходящий в печени с помощью, как нетрудно догадаться, витамина К.
                Прямые оральные антикоуглянты являются препаратами первой линии, так как они значительно удобнее в использовании и не менее 
                (а по отдельным исследованиям и более) эффективны. При приёме антагонистов витамина K необходимо отслеживать МНО — он есть в коагулограмме 
                (исследование свёртываемости крови). Для этого необходимо раз в месяц сдавать венозную кровь, а при подборе дозы и чаще.
            </p>
            <p>Основной и побочный эффект этих препаратов — не дают образоваться тромбам, но могут вызвать кровотечения. К счастью, есть шкалы, 
                позволяющие оценить этот риск и оптимально подобрать препараты, поэтому можно назвать их относительно безопасными.</p>
            <p>Основные препараты:</p>
            <ul>
                <li>Ривароксабан (Антитромикс, Аровабан)— ПОАК.</li>
                <li>Апиксабан (Аксиорекс, Апиклис)— ПОАК.</li>
                <li>Дабигатрана  этексилат (Аксартобан)— ПОАК.</li>
                <li>Варфарин (торговое название то же) — антагонист витамина K.</li>
            </ul>
        </div>,
        category: "Лекарства",
        img: drug
    },
    {
        id: 6,
        title: "Ингибиторы миозина",
        content: <div>Препараты этой группы направлены на снижение силы сокращения сердца — не с помощью внешних факторов, а действуя на сам сократительный аппарат сердца. 
            Моторы сердца зовутся саркомеры и содержат два главных белка — актин и миозин.  
            Актин закреплен, а миозин двигается относительно него, уменьшая расстояние между 
            местами закрепления актина. Ингибиторы миозина мешают этому взаимодействию, поэтому расслабляют сердце — 
            оно лучше наполняется кровью и обеспечивает себя и другие органы кислородом.
            <p>В этой группе есть 2 препарата — мевакамтен (не зарегистрирован в России) и афикамтен (находится в клинических испытаниях).  
            </p> 
        </div>,
        category: "Лекарства",
        img: drug
    }
]

export const surgeries = [
    {
        id: 1,
        title: "Миоэктомия",
        content: <div>
            <p>Это операция, суть которых заключается в удалении части межжелудочковой перегородки. 
                Если медикаментозное лечение не помогает, то это очень хороший вариант, операция является 
                эффективной для облегчения симптомов — успех составляет 90%.  Более того, эта операция 
                снижает нагрузку на сердце, так как устраняется препятствие для выхода крови — поэтому 
                снижается риск развития сердечной недостаточности.У каждой операции есть показания и противопоказания, 
                есть они и у миоэктомии.
            </p>
            <p>Когда могут рекомендовать эту операцию:</p>
            <ul>
                <li>Есть тяжелые симптомы несмотря на лечение препаратами.</li>
                <li>Есть тяжелая легочная гипертензия (повышенное давление, но в легочных сосудах), 
                    возникшая как осложнение ГКМП.</li>
                <li>Если увеличено левое предсердие и есть фибрилляция предсердий.</li>
                <li>Если в молодом возрасте очень высокий градиент давления на аортальном клапане 
                    ({'>'} 100 мм рт. ст.) в покое — чтобы предупредить развитие симптомов и сделать операцию, 
                    когда она имеет более высокие шансы окончиться хорошо.</li>
            </ul>
            <p>Когда не рекомендуют:</p>
            <ul>
                <li>Когда есть много сопутствующих болезней 
                    — это увеличивает риски осложнений при операции. Альтернативой служить этанольная септальная абляция.</li>
            </ul>
            <p>
                <b>Ход операции</b>
            </p>
            <p>Обычно операция занимает — 3-6 часов. Для начала хирурги делают доступ к сердцу — 
                добираются до него через все вышележащие ткани. Для этого необходимо разрезать кожу, 
                подкожно-жировую клетчатку и распилить грудину (кость, к которой спереди прикрепляются ребра). 
                После этого рассекают окружающий сердце мешочек — перикард. </p>
            <p>Операцию на работающем сердце выполнять почти что невозможно, поэтому подключают аппарат искусственного 
                кровообращения — вставляют трубки в правое предсердие (или в полые вены) и аорту. По первой кровь забирают, 
                потом насыщают кислородом, замещая функцию легких, и по второй трубке под давлением возвращают в организм.</p>
            <p>Дальше есть варианты, как можно сделать миоэктомию:</p>
            <ul>
                <li>Самый используемый — трансаортально (миоэктомия по Морроу). 
                    Рассекается аорта и часть межжелудочковой перегородки удаляется, не трогая левый желудочек.</li>
                <li>Опытные хирурги могут это сделать трансапикально (через верхушку сердца).</li>
                <li>При среднежелудочковой обструктивной ГКМП можно использовать доступ из правого желудочка.</li>
                <li>Также при наличии опыта это операция делается транспредсердным и трансжелдочковым способом — 
                    но это исключительные случаи.</li>
                <li>Иногда для хорошего результата эти доступы комбинируют, так каждый из них имеет свои преимущества и недостатки.</li>
            </ul>
            <p>Если в сердце есть какая-нибудь ещё проблема, её решают в ходе той же операции — выполняют реконструкцию клапана, восстанавливают 
                нормальную функцию сосочковых (папиллярных) мышц, устраняют фибрилляцию предсердий операцией “Лабиринт”. 
                В ислледованиях было показано, что одномоментное выполение лучше по сравнению с несколькими раздельными операциями.</p>
            <p>После выполнения основного этапа восстанавливают собственное кровообращение и всё то, что разрезали — скрепляют грудину скобами 
                (которые потом видны на рентгене грудной клетки), зашивают мышцы и кожу, оставляя в грудной клетке конца трубок (дренажей).</p>
            <p>Несмотря на то, что операция выглядит очень сложной и страшной, похожие операции на открытом сердце выполняются людям 
                каждый день — например, аорто-коронарное шунтирование (выполняется людям с ишемической болезнью сердца).</p>
            <p>Во время операции состояние сердца контролируют с помощью чреспищеводного ЭхоКГ.</p>
            <p><b>Послеоперационный уход</b></p>
            <p>После операции несколько дней придется провести в реанимации — для контроля за состоянием и чтобы можно было быстро лечить осложнения,
                 если они возникнут. Отслеживают количество жидкости, которая отходит по дренажам — если отходит немного, то дренажи удаляют.</p>
            <p>Важна ранняя двигательная активность — движение своими ногами обеспечивает отток венозной крови, она не застаивается и уменьшается риск 
                тромбозов. Сначала бывает трудно ходить, но со временем все восстанавливается.</p>
            <p><b>Осложнения</b></p>
            <ul>
                <li>Атриовентрикулярная блокада 3 степени (импульсы от предсердий не проходят к желудочкам), частота — {'<'} 5 %. 
                    Это осложнение связано с тем, что проводящие импульсы пути находятся в межжелудочковой перегородке, 
                    которую уменьшают при операции. Лечится установкой электрокардиостимулятора.</li>
                <li>Осложнения, характерные для всех кардиохирургических операций — {'<'} 5 %. 
                    Они включают в себя кровотечения, проблемы с коронарными артериями, инфекции, тампонаду сердца.</li>
                <li>Повторную операцию приходится делать менее чем в 3% случаев.</li>
                <li>Смертельные исходы, к сожалению, бывают, но составляют менее 1% случаев.</li>
            </ul>
            <p>Также после операции может развится фибрилляция предсердий — она обычно уходит до выписки. 
                Из других нарушений ритма бывает блокада левой ножки пучка Гиса (БЛНПГ) — это один из проводящих путей в сердце.</p>
        </div>,
        category: "Хирургическая операция",
        img: myoectomia
    },
    {
        id: 2,
        title: "Этанольная септальная абляция",
        content:<div>
                <p>Менее инвазивная процедура, чем миоэктомия, идёт 1-2 часа. Однако у нее есть ограничения — размер межжелудочковой 
                    перегородки не должен превышать 30 мм и анатомия коронарных артерий должна быть подходящей. Обычно её рекомендуют, 
                    если есть много заболеваний, не позволяющих сделать миоэктомию.</p>
                <p><b>Ход вмешательства</b></p>
                <p>Операция похожа на коронарангиографию, которую делают очень многим пациентам с ишемической болезнью сердца.</p>
                <p>Для начала входят в какую либо из артерий — обычно это бедренная артерий. В нее вводят инструменты, и вверх по 
                    подвздошным сосудам и аорте доходят до устья коронарных артерий, забираются катетером в них и проводят его до 
                    септальной (перегородочной) ветви. В нее вводят концентрированный спирт — для артерий он токсичен, поэтому 
                    кровоснабжение по этой ветви прекращается. В перегородке возникает локальный микроинфаркт, за счет чего она уменьшается.</p>
                <p>С тем как проходит абляция связаны и её ограничения — необходимо чтобы септальная ветвь была одна и кровоснабжала нужные структуры.</p>
                <p>Возможность проведения этой процедуры определяется до операции — проводят коронарангиографию, в септальную ветвь вводят вещество, 
                    которое хорошо видно на ультразвуке и проводят ЭхоКГ. Так хорошо видно какую часть кровоснабжает эта артерия и сколько их.</p>
                <p><b>Осложнения</b></p>
                <ul>
                    <li>Атриовентрикулярный блок 3 степени — чаще чем при миоэктомии, в 10% случаев.</li>
                    <li>Другие осложнения составляют менее 5%, смертность менее 1%.</li>
                    <li>Повторную операцию приходится делать в 10% случаев.</li>
                </ul>
                <p>К частым осложнениям относится блокада правой ножки пучка Гиса (БПНПГ) — однако большое количество здоровых людей имеют её и без операции. 
                    С этим связана большая частота атриовентрикулярной блокады 3 степени, если её миоэктомию приходится проводить после аблации. 
                    Миоэктомия вызывает БЛНПГ, а ножек у пучка Гиса всего две — правая и левая.</p>
        </div>,
        category: "Интервеционное вмешательство",
        img: ablation
    }
]

export const devices= [
    {
        id: 1,
        title: "ИКД",
        content: <div>
            <p>
                Имплантируемый кардиовертер-дефибриллятор. Это устройство, которое отслеживает электрическую активность сердца и при возникновениии опасной аритмии 
                подаёт разряд, возвращающий сердцу синусовый (нормальный) ритм. Бывает два вида ИКД: трансвенозный (на картинке) и подкожный.
            </p>
            <p>
                Трансвенозные ИКД имеют и функцию ЭКС — отслеживают, не слишком медленный ли ритм, и при необходимости посылает собственные стимулы для сокращения. 
                Он имеет две части — процессор и электроды. Электроды устанавливаются в камеры сердца — правое предсердие и правый желудочек, и подсоединяются 
                к процессору, обычно устанавливающегося под правую ключицу. 
            </p>
            <p>
                Подкожные ИКД не имеют возможности стимулировать сердце и поэтому не используются в случаях, когда это необходимо (например, при 
                атриовентрикулярной  блокаде 3 степени, возникшей после операции). Но его электрод устанавливается не сердце, а паралелльно грудине, 
                поэтому нет риска смещения электродов, повреждения вен и эндокардита.
            </p>
            <p>Энергия для работы обоих устройств обеспечивается литиевой батарейкой, она служит около 7 лет, потом потребуется замена.</p>
            <p><b>Установка</b></p>
            <ul>
                <li>Трансвенозный ИКД: Подключение ИКД это небольшая операция, проходящая либо под общей анестезией, либо под седацией. Электроды 
                    через подключичную вену вводят в камеры сердца и закрепляют там. Сердце при этом не трогают — оно работает на протяжении всей процедуры. 
                    Во время операции устройство проверят и запрограммируют на требуемый режим работы. Не требует долгого пребывания в стационаре. После 
                    операции не рекомендуется 2-3 недели поднимать руки выше плеч — чтобы избежать смещения электродов. Осложнения после операции включают 
                    в себя инфекции (например, эндокардит) и кровотечения.</li>
                <li>Подкожный ИКД: Также небольшая операция, не требующая даже входа в вену.</li>
            </ul>
            <p>К сожалению, со временем устройство может выйти из строя — начать  реагировать на неопасные стимулы, перестать стимулировать сердце когда необходимо, 
                могут отойти или переместиться электроды. Это случается нечасто, и требует перепрограммирования либо замены ИКД/его электродов.</p>
            <p><b>Важные моменты</b></p>
            <ul>
                <li>Как будет ощущаться работа ИКД: в режиме ЭКС каких либо изменений в ощущениях не отмечается, однако момент разряда скорее всего будет болезненным
                     — все таки это электрический разряд. Это серьезно влияет на качество жизни, если будет случаться часто, но есть методы, позволяющие уменьшить 
                     частоту возникновения опасных аритмий и срабатывания ИКД. Врач может назначить амиодарон либо предложить пройти катетерную аблацию аритмогенных зон.</li>
                <li>Это устройство, защищающее вас от смерти, но не само по себе не предотвращающее возникновение аритмий — поэтому фибрилляция предсердий не прекратится,
                     как и другие аритмии. </li>
                <li>ИКД, как и ЭКС, подвержен влиянию находящихся поблизости электронных устройств, поэтому в аэропорту нельзя проходить контроль обычным путем — 
                    ИКД может ошибочно воспринять электромагнитные колебания за аритмию и дать разряд. Вам будет выдана карта владельца ЭКС, которую нужно будет показать. 
                    То же касается других устройств — мобильного телефона, электробритвы, наушников, телевизора и т. д.  Безопасная дистанция составляет 15-20 см. 
                    Также внимание стоит обратить на приборы, с которыми Вы работаете — если среди них есть мощные (например, Вы электрик, работающий на высоковольтных линиях), 
                    необходимо посоветоваться со специалистом. </li>
                <li>Необходимо будет приходить на проверку устройства раз в полгода.</li>
                <li>Также нужно говорить докторам, что у вас имеется ИКД — это может влиять на выбор методов исследования. 
                    Например, есть модели ИКД, несовместимые с МРТ.</li>
                <li>Вид ЭКГ может меняться в момент работы ИКД как ЭКС.</li>
            </ul>
        </div>,
        category: "Имплантируемые медицинские устройства",
        img: ICD
    },
    {
        id: 2,
        title: "ЭКС",
        content: <div>
            <p>
                Электрокардиостимулятор. Используется для искуственной стимуляции сердца, если собственный водитель ритма 
                (синусовый узел) по каким либо причинам не справляется сам. Причины могут быть различными — например, 
                установка ЭКС может потребоваться, если после этанольной септальной абляции или септальной миоэктомии возникла 
                атриовентрикулярная блокада 3 степени. Это значит, что импульс от предсердий не проходит к желудочкам. На этот 
                случай в желудочках включается собственная генерация импульсов, это называется идиовентрикулярный ритм. Однако 
                он слишком редок — около 40 импульсов в минуту. Электрокардиостимулятор отслеживает, когда сократились предсердия,
                и после небольшой задержки, как и в норме, стимулирует желудочки. Электроды чаще всего стоят в правом предсердии 
                и правом желудочке. Поэтому импульс распространяется не в обычной последовательности и ЭКГ может выглядеть не так 
                как оно выглядело раньше.
            </p>
            <p>
                Другим важным примером использования ЭКС являются аритмии, которые можно прекратить если достаточно часто стимулировать 
                сердце (при этом разряд не используется). При стимуляции происходит электрическая перезагрузка клеток миокрада, 
                поэтому аритмия может самопроизвольно прекратиться.
            </p>
            <p>
                Процедура проходит так же, как при установке трансвенозного ИКД, теми же являются осложнения и ограничения, 
                касающиеся электронных приборов. Необходимо будет так же раз в полгода посещать врача для проверки ЭКС. 
                Возможно, потребуется изменить настройки. Перепрограммирование не требует операции, оно происходит с 
                помощью специального устройства — программатора, которое подносится к коже над ЭКС.
            </p>
        </div>,
        category: "Имплантируемые медицинские устройства",
        img: ECS
    }
]