import HamburgerMenu from '../components/Menu';
import '../../styles/DiseaseInfo.css';
import Contacts from '../components/Contacts';
import { Link } from 'react-router-dom';
import Revisor from '../components/Revisor';

export default function Registr(){
    return (
        <div>
            <HamburgerMenu />
            <div className='generalStyle'>
                <div className="blockWhite">
                    <div className="textHeaderGrey">
                        <p>Найденные регистры пациентов с ГКМП</p>
                    </div>
                    <div className='textGrey'>
                        В ФГБУ "НМИЦ им. Алмазова" 7 июня 2021 года зарегистрирована электронная база данных детей с ГКМП.
                        <p>
                            База данных содержит сведения о пациентах детского возраста с гипертрофической кардиомиопатией (ГКМП): 
                        краткий акушерский анамнез матери, историю родов и беременности, сведения о жалобах, кратком семейном анамнезе, 
                        особенностях периода новорожденности, перенесенных заболеваниях, обстоятельствах выявления ГКМП, данные физикального 
                        осмотра, результаты лабораторных исследований (биохимический анализ крови, в том числе генетический), а также данные 
                        углубленного кардиологического обследования: ЭКГ, CM-ЭКГ, СМАД, Эхо-КГ, нагрузочные пробы, МРТ сердца. БД обеспечивает
                        динамическое наблюдение детей с ГКМП. Это позволяет оценивать риски внезапной сердечной смерти и решать вопрос о выборе 
                        метода терапии у детей с ГКМП. БД может использоваться в качестве научного материала для исследования течения заболевания, 
                        определения новых патогенных генов ГКМП, разработки генной терапии данной патологии, модификации алгоритма обследования 
                        пациентов с ГКМП. БД дает возможность изучения частоты встречаемости детей с ГКМП. БД может применяться в качестве 
                        справочно-поискового материала для медицинских работников.
                        </p>
                    </div>
                </div>
            </div>
            <Contacts />
        </div>)}